{
    "complimentary": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A complimentary item or service is provided for free.",
                "example_sentences": [
                    "At the quaint little inn, guests were greeted with a complimentary glass of wine upon arrival."
                ],
                "usage": "a complimentary glass of wine",
                "Chinese": "一杯免费的葡萄酒",
                "regional_note": ""
            }
        ]
    ],
    "coke and fries": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "Coke and fries refers to a common pairing of a Coca-Cola and a serving of chips, often enjoyed as a quick snack or part of a casual meal.",
                "example_sentences": [
                    "After the football match, we stopped at a cafe for coke and fries."
                ],
                "usage": "order coke and fries",
                "Chinese": "点一份可乐和薯条",
                "regional_note": ""
            }
        ]
    ],
    "still working on sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If someone says they are still working on it, it means they are continuing to work on a task and have not yet finished.",
                "example_sentences": [
                    "When asked about the status of his report, John replied that he was still working on it."
                ],
                "usage": "still working on the report",
                "Chinese": "还在需要一些时间完成报告",
                "regional_note": ""
            }
        ]
    ],
    "go with sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you go with something, it means you choose or select it as your option.",
                "example_sentences": [
                    "For the main course, I think I'll go with the roast beef."
                ],
                "usage": "go with the roast beef",
                "Chinese": "点一份烤牛肉",
                "regional_note": ""
            }
        ]
    ],
    "go grab sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you go grab something, you quickly and informally go to get or buy it.",
                "example_sentences": [
                    "Could you go grab some milk on your way back? We're almost out."
                ],
                "usage": "go grab some milk",
                "Chinese": "去买一些牛奶",
                "regional_note": ""
            }
        ]
    ],
    "quite ill": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If someone is quite ill, they are very sick, often implying a significant degree of illness.",
                "example_sentences": [
                    "He was quite ill last week and had to miss several days of school."
                ],
                "usage": "feel quite ill",
                "Chinese": "感到非常不舒服",
                "regional_note": ""
            }
        ]
    ],
    "call in sick": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you call in sick, you inform your workplace that you are ill and unable to attend work.",
                "example_sentences": [
                    "After waking up feeling dreadful, Sarah decided she had to call in sick and rest."
                ],
                "usage": "call in sick today",
                "Chinese": "今天请了病假",
                "regional_note": ""
            }
        ]
    ],
    "come down with sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you come down with something, it means you begin to suffer from an illness, typically suddenly.",
                "example_sentences": [
                    "Halfway through the term, he came down with the flu and missed several lectures."
                ],
                "usage": "come down with the stomachache",
                "Chinese": "突然感到肚子痛",
                "regional_note": ""
            }
        ]
    ],
    "feverish": [
        "",
        [
            {
                "part_of_speech": "phrase",
                "definition": "If someone is feverish, they have a fever and may feel hotter than usual, often as part of an illness.",
                "example_sentences": [
                    "The child felt feverish in the night, prompting a call to the doctor first thing in the morning."
                ],
                "usage": "feel slightly feverish",
                "Chinese": "感到有点发烧",
                "regional_note": ""
            }
        ]
    ],
    "a reservation under the name": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you have a reservation under the name, it means you have booked or reserved a service or place, such as a table or a room, registered under that specific name.",
                "example_sentences": [
                    "Upon arriving at the restaurant, he told the host, 'I have a reservation under the name Smith.'"
                ],
                "usage": "have a reservation under the name Smith",
                "Chinese": "在Smith的名下订了一个房间",
                "regional_note": ""
            }
        ]
    ],
    "a mix-up": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A mix-up is a situation where a misunderstanding or mistake has caused confusion.",
                "example_sentences": [
                    "Due to a mix-up in the schedule, both meetings were booked for the same conference room."
                ],
                "usage": "a mix-up in the system",
                "Chinese": "系统里的一个差错",
                "regional_note": ""
            }
        ]
    ],
    "be overbooked": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If a service or venue is overbooked, it means that more reservations were accepted than there is available capacity.",
                "example_sentences": [
                    "The flight to Edinburgh was overbooked, so the airline offered vouchers to passengers willing to take a later departure."
                ],
                "usage": "a restaurant that is overbooked every day",
                "Chinese": "一间每天都被订满的饭店",
                "regional_note": ""
            }
        ]
    ],
    "resources": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "Resources are supplies, materials, or money that are available for use to achieve goals or complete tasks.",
                "example_sentences": [
                    "The charity had limited resources but managed to make a significant impact with what they had."
                ],
                "usage": "allocate more resources to the project",
                "Chinese": "在这个项目上花更多的钱",
                "regional_note": ""
            }
        ]
    ],
    "be understaffed": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If a business or organisation is understaffed, it does not have enough employees to operate effectively.",
                "example_sentences": [
                    "The shop was understaffed on Saturday, which led to longer waiting times for customers."
                ],
                "usage": "a department that is understaffed",
                "Chinese": "一个人手不够的部门",
                "regional_note": ""
            }
        ]
    ],
    "the timing is just not right": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you say the timing is just not right, you mean that it is not a suitable or appropriate moment for a particular action or event.",
                "example_sentences": [
                    "He wanted to launch the new product in April, but I felt the timing was just not right."
                ],
                "usage": "refuse him by saying the timing is just not right",
                "Chinese": "拒绝了他，说时机还不成熟",
                "regional_note": ""
            }
        ]
    ],
    "take some of the weight off one's shoulders": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you take some of the weight off someone's shoulders, you reduce their burden or responsibility.",
                "example_sentences": [
                    "When Jane offered to help with the project, it really took some of the weight off my shoulders."
                ],
                "usage": "take some of the weight off his shoulders",
                "Chinese": "减轻他的负担",
                "regional_note": ""
            }
        ]
    ],
    "give sb. a hand": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you give someone a hand, you help them with a task.",
                "example_sentences": [
                    "Could you give me a hand with these boxes? They're rather heavy to move alone."
                ],
                "usage": "give me a hand with the luggage",
                "Chinese": "帮我搬行李",
                "regional_note": ""
            }
        ]
    ],
    "be a mile long": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something is described as being a mile long, it means it is extremely long, often in a hyperbolic sense.",
                "example_sentences": [
                    "The queue for the concert tickets was a mile long; it seemed everyone in town wanted to go."
                ],
                "usage": "surprised to see the to-do list that must be a mile long",
                "Chinese": "看到那份长长的待办事项单，感到很吃惊",
                "regional_note": ""
            }
        ]
    ],
    "cut in line": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If someone cuts in line, they unfairly move in front of others who are waiting in order, typically in a queue.",
                "example_sentences": [
                    "It's quite rude to cut in line; please wait your turn like everyone else."
                ],
                "usage": "cut in line at the supermarket",
                "Chinese": "在超市插队",
                "regional_note": ""
            }
        ]
    ],
    "there's no way": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "The phrase 'there's no way' expresses impossibility or extreme unlikelihood of an event occurring.",
                "example_sentences": [
                    "There's no way we can finish all this work by the end of the day without some extra help."
                ],
                "usage": "realised there's no way to meet the deadline",
                "Chinese": "意识到不可能在截止日期前完成",
                "regional_note": ""
            }
        ]
    ],
    "jump the queue": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If someone jumps the queue, they unfairly move ahead of others who have been waiting in line longer.",
                "example_sentences": [
                    "At the bus stop, a gentleman tried to jump the queue, causing quite a stir among the waiting passengers."
                ],
                "usage": "jump the queue at the post office",
                "Chinese": "在邮局插队",
                "regional_note": ""
            }
        ]
    ],
    "be packed": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If a place is packed, it is extremely full, usually with people.",
                "example_sentences": [
                    "The pub was packed on Friday night, making it difficult to find a seat."
                ],
                "usage": "the museum that is packed with pupils",
                "Chinese": "挤满了学生的博物馆",
                "regional_note": ""
            }
        ]
    ],
    "munchies": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "Munchies are snacks, especially those eaten between meals or late at night.",
                "example_sentences": [
                    "During the film, we enjoyed some crisps and sweets, the perfect munchies for a movie night."
                ],
                "usage": "enjoy some munchies",
                "Chinese": "吃了一些零食",
                "regional_note": ""
            }
        ]
    ],
    "fill up the tank": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you fill up the tank, you put fuel in a vehicle's fuel tank until it is full.",
                "example_sentences": [
                    "Before the long drive, we made sure to fill up the tank to avoid stopping midway."
                ],
                "usage": "fill up the tank before setting off",
                "Chinese": "在出发前加满油箱",
                "regional_note": ""
            }
        ]
    ],
    "be all set": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If someone is all set, they are fully prepared or ready for something.",
                "example_sentences": [
                    "Once the luggage was in the car, we were all set for our holiday."
                ],
                "usage": "be all set for the holiday",
                "Chinese": "为度假做好了准备",
                "regional_note": ""
            }
        ]
    ],
    "get all the bases covered": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you get all the bases covered, you ensure that all aspects of a situation have been considered or dealt with.",
                "example_sentences": [
                    "Before launching the product, the team met to ensure they had all the bases covered."
                ],
                "usage": "get all the bases covered for the event",
                "Chinese": "为活动做好了所有准备",
                "regional_note": ""
            }
        ]
    ],
    "get going": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If someone gets going, they start moving or begin a journey.",
                "example_sentences": [
                    "It's getting late; we should really get going if we want to be there on time."
                ],
                "usage": "get going before it gets dark",
                "Chinese": "在天黑之前出发",
                "regional_note": ""
            }
        ]
    ],
    "a pit stop": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A pit stop is a brief stop during a journey, typically to use the restroom or get food or fuel.",
                "example_sentences": [
                    "We took a quick pit stop at the service station to stretch our legs and buy some coffee."
                ],
                "usage": "make a pit stop",
                "Chinese": "短暂停车休息",
                "regional_note": ""
            }
        ]
    ],
    "highway toll": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A highway toll is a fee charged for using certain roads, typically motorways or bridges.",
                "example_sentences": [
                    "When driving to Scotland, one must be prepared to pay the highway toll near Birmingham."
                ],
                "usage": "pay the highway toll",
                "Chinese": "付高速公路通行费",
                "regional_note": ""
            }
        ]
    ],
    "rental car": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A rental car is a vehicle hired from a company for a temporary period, used primarily by travellers.",
                "example_sentences": [
                    "During our trip to Lake District, we used a rental car to explore the remote areas."
                ],
                "usage": "use a rental car",
                "Chinese": "开一辆租来的车",
                "regional_note": ""
            }
        ]
    ],
    "trunk": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "The trunk is the compartment at the rear of a vehicle used for storing luggage and other items.",
                "example_sentences": [
                    "Please put your suitcase in the trunk; there's plenty of space for it."
                ],
                "usage": "store luggage in the trunk",
                "Chinese": "把行李放在后备箱里",
                "regional_note": ""
            }
        ]
    ],
    "form a queue": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If people form a queue, they line up one behind the other, usually to wait for goods or services.",
                "example_sentences": [
                    "At the theatre, patrons were asked to form a queue at the box office."
                ],
                "usage": "form a queue at the ticket counter",
                "Chinese": "在售票处前面排队",
                "regional_note": ""
            }
        ]
    ],
    "concierge": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A concierge is a hotel employee who assists guests by making reservations, giving directions, and arranging transportation.",
                "example_sentences": [
                    "The concierge was most helpful in booking us a table at the highly recommended restaurant nearby."
                ],
                "usage": "a friendly concierge",
                "Chinese": "一位友好的门房",
                "regional_note": ""
            }
        ]
    ],
    "make it into work": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you make it into work, you manage to arrive at your workplace, typically implying difficulties in doing so.",
                "example_sentences": [
                    "Despite the heavy snow, she managed to make it into work on time."
                ],
                "usage": "make it into work despite the traffic",
                "Chinese": "尽管交通拥堵，还是准时到了上班的地方",
                "regional_note": ""
            }
        ]
    ],
    "freeze": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If a computer freezes, it stops working properly and becomes unresponsive.",
                "example_sentences": [
                    "My computer froze while I was in the middle of writing an important email."
                ],
                "usage": "The computer froze.",
                "Chinese": "电脑死机了。",
                "regional_note": ""
            }
        ]
    ],
    "infected file": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "An infected file is a file on a computer that contains a virus or malicious software.",
                "example_sentences": [
                    "The antivirus programme detected an infected file and removed it immediately."
                ],
                "usage": "delete the infected file",
                "Chinese": "删除带病毒的文件",
                "regional_note": ""
            }
        ]
    ],
    "up to date": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something is up to date, it has all the most recent information or is modern.",
                "example_sentences": [
                    "Make sure your software is up to date to protect against security vulnerabilities."
                ],
                "usage": "keep the system up to date",
                "Chinese": "保持系统处于最新的状态",
                "regional_note": ""
            }
        ]
    ],
    "act up": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something acts up, it does not work properly or behaves erratically.",
                "example_sentences": [
                    "My car started acting up on the way to work, so I had to take it to the mechanic."
                ],
                "usage": "The computer acted up.",
                "Chinese": "电脑的屏幕一动不动。",
                "regional_note": ""
            }
        ]
    ],
    "be right up": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If someone says they will be right up, they mean they will go upstairs very soon.",
                "example_sentences": [
                    "I'll be right up with your tea, just need to finish washing these dishes."
                ],
                "usage": "be right up with the drinks",
                "Chinese": "马上就会把饮料端上楼",
                "regional_note": ""
            }
        ]
    ],
    "pick up": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you pick something up, you get or acquire it.",
                "example_sentences": [
                    "I need to pick up some milk from the corner shop on my way home."
                ],
                "usage": "pick up some milk from the store",
                "Chinese": "从商店买一些牛奶",
                "regional_note": ""
            }
        ]
    ],
    "in a bit of a hurry": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If someone is in a bit of a hurry, they do not have much time and need to rush.",
                "example_sentences": [
                    "Sorry, I can't stop to chat - I'm in a bit of a hurry to catch my train."
                ],
                "usage": "be in a bit of a hurry to catch the bus",
                "Chinese": "正在急着赶公车",
                "regional_note": ""
            }
        ]
    ],
    "slip one's mind": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something slips one's mind, it is forgotten.",
                "example_sentences": [
                    "I meant to call you yesterday, but it completely slipped my mind."
                ],
                "usage": "Your name just slipped my mind.",
                "Chinese": "我刚才忘了你的名字",
                "regional_note": ""
            }
        ]
    ],
    "around here": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something is around here, it is close to or near this place.",
                "example_sentences": [
                    "There are some lovely parks around here that are perfect for a weekend stroll."
                ],
                "usage": "the shops around here",
                "Chinese": "这附近的商店",
                "regional_note": ""
            }
        ]
    ],
    "be terrible with": [
        "",
        [
            {
                "part_of_speech": "phrase",
                "definition": "If someone is terrible with something, they are very bad at it.",
                "example_sentences": [
                    "I'm terrible with names; I often forget them right after being introduced."
                ],
                "usage": "be terrible with directions",
                "Chinese": "方向感很差",
                "regional_note": ""
            }
        ]
    ],
    "inconsiderate": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If someone is inconsiderate, they do not think about the feelings or needs of others.",
                "example_sentences": [
                    "It was rather inconsiderate of him to play loud music late at night."
                ],
                "usage": "an inconsiderate neighbour",
                "Chinese": "一个不体贴的邻居",
                "regional_note": ""
            }
        ]
    ],
    "keep it down": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you tell someone to keep it down, you are asking them to be quiet.",
                "example_sentences": [
                    "Could you keep it down, please? I'm trying to concentrate on my work."
                ],
                "usage": "ask him to keep it down",
                "Chinese": "请他安静一点",
                "regional_note": ""
            }
        ]
    ],
    "not such a big deal": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something is not such a big deal, it is not a significant problem.",
                "example_sentences": [
                    "Don't worry about the mistake in the report; it's not such a big deal."
                ],
                "usage": "not such a big deal to miss the bus",
                "Chinese": "错过公车不是什么大事",
                "regional_note": ""
            }
        ]
    ],
    "can't hear a thing": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If someone says they can't hear a thing, they are unable to hear anything.",
                "example_sentences": [
                    "I can't hear a thing with all this noise from the construction outside."
                ],
                "usage": "can't hear a thing with the music on",
                "Chinese": "开着音乐什么都听不见",
                "regional_note": ""
            }
        ]
    ],
    "good riddance": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you say 'good riddance', you mean that you are glad to be rid of someone or something unpleasant.",
                "example_sentences": [
                    "When he finally left the company, everyone said, 'Good riddance!'"
                ],
                "usage": "good riddance to bad rubbish",
                "Chinese": "那个坏人终于走了",
                "regional_note": ""
            }
        ]
    ],
    "good grief": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you say 'good grief', you are expressing surprise or shock.",
                "example_sentences": [
                    "Good grief, how did you manage to finish that project so quickly?"
                ],
                "usage": "Good grief, what a mess!",
                "Chinese": "天啊，这么乱！",
                "regional_note": ""
            }
        ]
    ],
    "sth. comes to grief": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something comes to grief, it fails or ends in a bad way.",
                "example_sentences": [
                    "Their business venture came to grief when they ran out of funding."
                ],
                "usage": "feel sad when the project comes to grief",
                "Chinese": "当项目失败了以后感到难过",
                "regional_note": ""
            }
        ]
    ],
    "put someone out of his misery": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you put someone out of their misery, you end their suffering by resolving a difficult situation for them.",
                "example_sentences": [
                    "After weeks of uncertainty, she finally put him out of his misery and told him he had got the job."
                ],
                "usage": "put him out of his misery and tell him the truth",
                "Chinese": "告诉他真相，别吊他的胃口了",
                "regional_note": ""
            }
        ]
    ],
    "equilibrium": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "Someone's equilibrium is their normal calm state of mind.",
                "example_sentences": [
                    "She took a few deep breaths to regain her equilibrium before speaking."
                ],
                "usage": "regain one's equilibrium",
                "Chinese": "冷静下来",
                "regional_note": ""
            }
        ]
    ],
    "in remembrance of sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you do something in remembrance of someone or something, you do it to honour their memory.",
                "example_sentences": [
                    "The plaque was erected in remembrance of the soldiers who fought in the war."
                ],
                "usage": "a statue in remembrance of the fallen",
                "Chinese": "为阵亡者立的雕像",
                "regional_note": ""
            }
        ]
    ],
    "spark the trend of sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something sparks the trend of something, it starts a new popular activity or fashion.",
                "example_sentences": [
                    "Her unique fashion sense sparked the trend of vintage clothing among teenagers."
                ],
                "usage": "spark the trend of pyjama dressing",
                "Chinese": "引领了睡衣搭配的潮流",
                "regional_note": ""
            }
        ]
    ],
    "be quoted as saying that": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If someone is quoted as saying something, their exact words are repeated.",
                "example_sentences": [
                    "The Prime Minister was quoted as saying that the new policy would benefit the whole country."
                ],
                "usage": "be quoted as saying that the project was a success",
                "Chinese": "据说这个项目很成功",
                "regional_note": ""
            }
        ]
    ],
    "sth. occurs to sb.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something occurs to someone, they suddenly think of it.",
                "example_sentences": [
                    "It suddenly occurred to him that he had forgotten to lock the door."
                ],
                "usage": "became nervous when the thought occurred to him",
                "Chinese": "在他脑中突然闪过这个念头时变得紧张",
                "regional_note": ""
            }
        ]
    ],
    "bump into sb.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you bump into someone, you meet them unexpectedly.",
                "example_sentences": [
                    "I bumped into an old friend while walking through the park."
                ],
                "usage": "bump into a colleague",
                "Chinese": "碰到一个同事",
                "regional_note": ""
            }
        ]
    ],
    "answer for sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you answer for something, you are responsible for it and may be required to explain your actions.",
                "example_sentences": [
                    "He will have to answer for his mistakes when the manager returns."
                ],
                "usage": "answer for the missing documents",
                "Chinese": "对丢失的文件负责",
                "regional_note": ""
            }
        ]
    ],
    "be visible to sb.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something is visible to someone, it can be seen or noticed by them.",
                "example_sentences": [
                    "The landmark was visible to everyone from miles around."
                ],
                "usage": "be visible to the tourists from the top of the hill",
                "Chinese": "能被游客从山顶看到",
                "regional_note": ""
            }
        ]
    ],
    "dismiss sth. as pure speculation": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you dismiss something as pure speculation, you reject it as a baseless or unfounded guess.",
                "example_sentences": [
                    "The scientist dismissed the rumours of a breakthrough as pure speculation."
                ],
                "usage": "dismiss the rumours as pure speculation",
                "Chinese": "否认了谣言，说这纯属猜测",
                "regional_note": ""
            }
        ]
    ],
    "put off": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you put off something, you delay it or postpone it to a later time.",
                "example_sentences": [
                    "They decided to put off the meeting until next week."
                ],
                "usage": "put off the meeting until tomorrow",
                "Chinese": "把会议推迟到明天",
                "regional_note": ""
            }
        ]
    ],
    "ever-present": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something is ever-present, it is always there or always present.",
                "example_sentences": [
                    "The ever-present smell of fresh bread was comforting."
                ],
                "usage": "the ever-present problem of traffic congestion",
                "Chinese": "一直存在的交通拥堵问题",
                "regional_note": ""
            }
        ]
    ],
    "scramble to do sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you scramble to do something, you move or act quickly because you are in a hurry.",
                "example_sentences": [
                    "The team scrambled to finish the project before the deadline."
                ],
                "usage": "scramble to complete the task",
                "Chinese": "手忙脚乱地完成任务",
                "regional_note": ""
            }
        ]
    ],
    "intrude on sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you intrude on something, you disturb or interrupt it in an unwelcome way.",
                "example_sentences": [
                    "He didn't want to intrude on their private conversation."
                ],
                "usage": "intrude on their conversation",
                "Chinese": "打扰他们的谈话",
                "regional_note": ""
            }
        ]
    ],
    "make way for sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you make way for something, you move aside to allow it to pass or make progress.",
                "example_sentences": [
                    "The old building was demolished to make way for a new shopping centre."
                ],
                "usage": "make way for the new generation",
                "Chinese": "为新一代产品让路",
                "regional_note": ""
            }
        ]
    ],
    "stuff sth. with sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you stuff something with something, you fill it tightly with a material or substance.",
                "example_sentences": [
                    "She stuffed the pillow with feathers to make it more comfortable."
                ],
                "usage": "stuff the pillow with feathers",
                "Chinese": "用羽毛把枕头塞满",
                "regional_note": ""
            }
        ]
    ],
    "be riddled with": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something is riddled with something, it is full of or affected by numerous instances of it.",
                "example_sentences": [
                    "The old house was riddled with damp and needed extensive repairs."
                ],
                "usage": "be riddled with errors",
                "Chinese": "错误百出",
                "regional_note": ""
            }
        ]
    ],
    "be related to": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something is related to another thing, it has a connection with it.",
                "example_sentences": [
                    "Her job is related to environmental conservation."
                ],
                "usage": "be related to the environment",
                "Chinese": "与环境有关",
                "regional_note": ""
            }
        ]
    ],
    "draw up the contract": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you draw up the contract, you prepare or write it.",
                "example_sentences": [
                    "The solicitor was asked to draw up the contract for the new house."
                ],
                "usage": "draw up the contract for the new project",
                "Chinese": "起草新项目的合同",
                "regional_note": ""
            }
        ]
    ],
    "fall victim to": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If someone falls victim to something, they suffer as a result of it.",
                "example_sentences": [
                    "Many people fall victim to online scams each year."
                ],
                "usage": "fall victim to the delayed train",
                "Chinese": "因为火车晚点而受害",
                "regional_note": ""
            }
        ]
    ],
    "usher in": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you usher in something, you cause it to start or happen.",
                "example_sentences": [
                    "The new technology is expected to usher in an era of economic growth."
                ],
                "usage": "usher in a new era",
                "Chinese": "开启新时代",
                "regional_note": ""
            }
        ]
    ],
    "rough neighbourhood": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A rough neighbourhood is an area that is considered dangerous or unpleasant to live in.",
                "example_sentences": [
                    "They grew up in a rough neighbourhood but managed to succeed despite the challenges."
                ],
                "usage": "avoid living in the rough neighbourhood",
                "Chinese": "避免住在乱糟糟的地方",
                "regional_note": ""
            }
        ]
    ],
    "the first of its kind": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something is the first of its kind, it is unique and has never been done or made before.",
                "example_sentences": [
                    "The new electric car model was the first of its kind in the market."
                ],
                "usage": "the first of its kind in the industry",
                "Chinese": "行业中独一无二",
                "regional_note": ""
            }
        ]
    ],
    "be packed with": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something is packed with something, it is full of or contains a large amount of it.",
                "example_sentences": [
                    "The festival was packed with exciting activities and performances."
                ],
                "usage": "be packed with tourists",
                "Chinese": "挤满了游客",
                "regional_note": ""
            }
        ]
    ],
    "hammer away at": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you hammer away at something, you work at it steadily and with great determination.",
                "example_sentences": [
                    "She hammered away at her dissertation for months until it was finally completed."
                ],
                "usage": "hammer away at the dissertation",
                "Chinese": "忙着写论文",
                "regional_note": ""
            }
        ]
    ],
    "feast on sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you feast on something, you eat a large amount of it with great enjoyment.",
                "example_sentences": [
                    "They feasted on a traditional Christmas dinner with all the trimmings."
                ],
                "usage": "feast on the delicious food",
                "Chinese": "大快朵颐",
                "regional_note": ""
            }
        ]
    ],
    "stick to sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you stick to something, you continue doing it despite difficulties or distractions.",
                "example_sentences": [
                    "He decided to stick to his exercise routine, even during the busy holiday season."
                ],
                "usage": "stick to the exercise routine",
                "Chinese": "坚持执行锻炼计划",
                "regional_note": ""
            }
        ]
    ],
    "make for": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "Make for means to contribute to or lead to a particular outcome.",
                "example_sentences": [
                    "His meticulous attention to detail makes for an excellent final product."
                ],
                "usage": "make for a successful entrepreneur",
                "Chinese": "成就了一位成功的企业家",
                "regional_note": ""
            }
        ]
    ],
    "be indicative of sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something is indicative of something, it shows or suggests the presence or nature of that thing.",
                "example_sentences": [
                    "The increase in house prices is indicative of a thriving economy."
                ],
                "usage": "be indicative of a strong market",
                "Chinese": "表明市场强劲",
                "regional_note": ""
            }
        ]
    ],
    "hit on sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you hit on something, you discover or think of it, often suddenly or by chance.",
                "example_sentences": [
                    "After hours of brainstorming, she finally hit on a brilliant idea for the project."
                ],
                "usage": "hit on a solution to the problem",
                "Chinese": "忽然找到了解决问题的办法",
                "regional_note": ""
            }
        ]
    ],
    "be fast approaching": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something is fast approaching, it is coming near in time.",
                "example_sentences": [
                    "With the deadline fast approaching, they had to work overtime to complete the assignment."
                ],
                "usage": "with the deadline fast approaching",
                "Chinese": "随着截止日期的临近",
                "regional_note": ""
            }
        ]
    ],
    "come as a shock to sb.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something comes as a shock to someone, it is completely unexpected and surprising to them.",
                "example_sentences": [
                    "The sudden resignation of the CEO came as a shock to the entire company."
                ],
                "usage": "come as a shock to the team",
                "Chinese": "让团队大吃一惊",
                "regional_note": ""
            }
        ]
    ],
    "in an instant": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something happens in an instant, it occurs very quickly.",
                "example_sentences": [
                    "The car disappeared around the corner in an instant."
                ],
                "usage": "disappear around the corner in an instant",

                "regional_note": "一下子在转角处消失"
            }
        ]
    ],
    "follow suit": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you follow suit, you do the same thing as someone else has just done.",
                "example_sentences": [
                    "When the first guest started dancing, everyone else followed suit."
                ],
                "usage": "follow suit and start dancing",
                "Chinese": "跟着跳起了舞",
                "regional_note": ""
            }
        ]
    ],
    "picture sth. as sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you picture something as something, you imagine or think of it in a particular way.",
                "example_sentences": [
                    "She always pictured the countryside as a peaceful and idyllic place to live."
                ],
                "usage": "picture the democracy as a perfect system",
                "Chinese": "把民主描绘成完美的制度",
                "regional_note": ""
            }
        ]
    ],
    "be suited to sb.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something is suited to someone, it is right or appropriate for them.",
                "example_sentences": [
                    "This quiet, rural life is really suited to him."
                ],
                "usage": "is suited to the students like him",
                "Chinese": "适合像他这样的学生",
                "regional_note": ""
            }
        ]
    ],
    "be on the verge of": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you are on the verge of something, you are about to experience it or do it.",
                "example_sentences": [
                    "She was on the verge of tears as she heard the news."
                ],
                "useage": "be on the verge of tears",
                "Chinese": "快要哭了",
                "regional_note": ""
            }
        ]
    ],
    "count on": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you count on something or someone, you rely on them to support you or help you.",
                "example_sentences": [
                    "You can always count on me for a helping hand."
                ],
                "usage": "count on the manager for support",
                "Chinese": "指望那个经理提供支持",
                "regional_note": ""
            }
        ]
    ],
    "pose a slight inconvenience": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something poses a slight inconvenience, it causes a small amount of trouble or difficulty.",
                "example_sentences": [
                    "The road closure will pose a slight inconvenience for local residents."
                ],
                "usage": "pose a slight inconvenience for the neighbours",
                "Chinese": "给邻居带来一点小麻烦",
                "regional_note": ""
            }
        ]
    ],
    "be bound to": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you are bound to do something, it is certain or very likely that you will do it.",
                "example_sentences": [
                    "With his talent, he is bound to succeed in his career."
                ],
                "usage": "be bound to lose the game",
                "Chinese": "注定会输掉比赛",
                "regional_note": ""
            }
        ]
    ],
    "at all times": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something is required at all times, it means it must be done continuously or always.",
                "example_sentences": [
                    "Passengers must keep their seatbelts fastened at all times during the flight."
                ],
                "usage": "keep the seatbelt fastened at all times",
                "Chinese": "保持安全带一直是系好的状态",
                "regional_note": ""
            }
        ]
    ],
    "in the nick of time": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something happens in the nick of time, it happens at the last possible moment before it is too late.",
                "example_sentences": [
                    "The firefighters arrived in the nick of time to save the building."
                ],
                "usage": "arrive in the nick of time",
                "Chinese": "在最后一刻赶到",
                "regional_note": ""
            }
        ]
    ],
    "why exactly": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you ask 'why exactly', you are seeking a precise or specific reason for something.",
                "example_sentences": [
                    "Why exactly did you decide to move to the countryside?"
                ],
                "usage": "ask why exactly he was late",
                "Chinese": "问他究竟为什么迟到了",
                "regional_note": ""
            }
        ]
    ],
    "from the perspective of sb": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you consider something from the perspective of someone, you look at it from their point of view or standpoint.",
                "example_sentences": [
                    "From the perspective of a teacher, the new policy is very beneficial."
                ],
                "usage": "consider the issue from the perspective of the students",
                "Chinese": "从学生的角度考虑这个问题",
                "regional_note": ""
            }
        ]
    ],
    "take shelter from sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you take shelter from something, you find a place to protect yourself from it.",
                "example_sentences": [
                    "We took shelter from the rain under a large oak tree."
                ],
                "usage": "take shelter from the storm",
                "Chinese": "躲避暴风雨",
                "regional_note": ""
            }
        ]
    ],
    "lose sth. to sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you lose A to B, you decide to give up A in order to attain B.",
                "example_sentences": [
                    "He lost his free time to his demanding job."
                ],
                "usage": "lose the weekend to work",
                "Chinese": "为了工作牺牲周末的时间",
                "regional_note": ""
            }
        ]
    ],
    "happen upon": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you happen upon something, you find or encounter it by chance.",
                "example_sentences": [
                    "While walking in the park, she happened upon an old friend."
                ],
                "usage": "happen upon a rare book",
                "Chinese": "偶然发现一本珍贵的书",
                "regional_note": ""
            }
        ]
    ],
    "conspire against sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If events or circumstances conspire against something, they work together to cause it to fail.",
                "example_sentences": [
                    "The weather and traffic conspired against our plans for a picnic."
                ],
                "usage": "conspire against the progress of the project",
                "Chinese": "一同阻碍项目的进展",
                "regional_note": ""
            }
        ]
    ],
    "not age well": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something does not age well, it means it becomes less appealing or relevant over time.",
                "example_sentences": [
                    "The special effects in that old film have not aged well."
                ],
                "usage": "the movie that did not age well",
                "Chinese": "那部已经过时的电影",
                "regional_note": ""
            }
        ]
    ],
    "hold up": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If a theory holds up, it withstands criticism, evidence, or challenges, and continues to be supported by the available data or reasoning.",
                "example_sentences": [
                    "Despite new research, his original theory still holds up."
                ],
                "usage": "the theory that holds up to scrutiny",
                "Chinese": "经得起推敲的理论",
                "regional_note": ""
            }
        ]
    ],
    "have trouble doing sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you have trouble doing something, you find it difficult to do.",
                "example_sentences": [
                    "She had trouble understanding the complex instructions."
                ],
                "usage": "have trouble using the new software",
                "Chinese": "觉得新软件很难用",
                "regional_note": ""
            }
        ]
    ],
    "toil away at sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you toil away at something, you work very hard and for a long time on it.",
                "example_sentences": [
                    "He toiled away at his novel for years before it was published."
                ],
                "usage": "toil away at his new book",
                "Chinese": "花很多时间写他的新书",
                "regional_note": ""
            }
        ]
    ],
    "bare the immense responsibility": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you bare the immense responsibility, you accept and deal with a very large and serious duty or obligation.",
                "example_sentences": [
                    "As the eldest son, he had to bare the immense responsibility of running the family business."
                ],
                "usage": "bare the immense responsibility of the project",
                "Chinese": "承担项目里的巨大责任",
                "regional_note": ""
            }
        ]
    ],
    "not a problem": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something is not a problem, it means it is easy to deal with or not an issue.",
                "example_sentences": [
                    "Don't worry about the extra work; it's not a problem for me."
                ],
                "usage": "not a problem for him to finish the task",
                "Chinese": "对他来说完成任务不是问题",
                "regional_note": ""
            }
        ]
    ],
    "connect to": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If a device or system connects to something, it links to it electronically or communicates with it.",
                "example_sentences": [
                    "My printer won't connect to my laptop anymore."
                ],
                "usage": "connect to the Wi-Fi network",
                "Chinese": "连接到无线网络",
                "regional_note": ""
            }
        ]
    ],
    "embark on": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you embark on something, you start a new project or period in your life.",
                "example_sentences": [
                    "She's about to embark on a journey around the world."
                ],
                "usage": "embark on a new career",
                "Chinese": "开始新的职业生涯",
                "regional_note": ""
            }
        ]
    ],
    "uppercase": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "Uppercase letters are capital letters used to begin sentences or for names.",
                "example_sentences": [
                    "Please ensure your password includes at least one uppercase letter."
                ],
                "usage": "include an uppercase letter in the password",
                "Chinese": "密码中包含一个大写字母",
                "regional_note": ""
            }
        ]
    ],
    "through the roof": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If prices, figures, or temperatures go through the roof, they increase very quickly to a very high level.",
                "example_sentences": [
                    "After the announcement, the company's stock prices went through the roof."
                ],
                "usage": "stock prices that went through the roof in a day",
                "Chinese": "在一天内飙升的股价",
                "regional_note": ""
            }
        ]
    ],
    "off the charts": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something is off the charts, it is far beyond normal levels or expectations.",
                "example_sentences": [
                    "The popularity of the new game is off the charts."
                ],
                "usage": "complain about the costs that are off the charts",
                "Chinese": "抱怨高得离谱的费用",
                "regional_note": ""
            }
        ]
    ],
    "go over": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you go over something, you examine, review, or check it.",
                "example_sentences": [
                    "Let's go over the plans once more to ensure everything is correct."
                ],
                "usage": "go over the details of the project",
                "Chinese": "再检查一遍项目的细节",
                "regional_note": ""
            }
        ]
    ],
    "look into": [
        "",
        [
            {
                "part_of_speech": "phrase",
                "definition": "If you look into something, you investigate or examine it closely.",
                "example_sentences": [
                    "There seems to be a problem with our booking; I'll look into it."
                ],
                "usage": "look into the issue with the booking",
                "Chinese": "调查预订时出现的的问题",
                "regional_note": ""
            }
        ]
    ],
    "take care of": [
        "",
        [
            {
                "part_of_speech": "phrase",
                "definition": "If you take care of something, you deal with it or resolve it.",
                "example_sentences": [
                    "Don't worry about the broken window; I'll take care of it."
                ],
                "usage": "take care of the broken window",
                "Chinese": "处理破了的窗户",
                "regional_note": ""
            }
        ]
    ],
    "the list goes on and on": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you say 'the list goes on and on', you mean that there are many more items or examples than you have mentioned.",
                "example_sentences": [
                    "She's talented at writing, painting, singing -- the list goes on and on."
                ],
                "usage": "The list of his achievements goes on and on",
                "Chinese": "他的成就不胜枚举",
                "regional_note": ""
            }
        ]
    ],
    "drive sales": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something drives sales, it causes an increase in the number of products sold.",
                "example_sentences": [
                    "The new advertising campaign really helped to drive sales."
                ],
                "usage": "think of strategies to drive sales",
                "Chinese": "想出推动销售的策略",
                "regional_note": ""
            }
        ]
    ],
    "match the competitors": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If a company or product matches the competitors, it is as good as or better than other companies or products in the same industry.",
                "example_sentences": [
                    "We need to improve our technology to match the competitors."
                ],
                "usage": "improve the quality of our products to match the competitors",
                "Chinese": "提高我们产品质量以赶上竞争对手",
                "regional_note": ""
            }
        ]
    ],
    "damned if you do, and damned if you don't": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you are damned if you do and damned if you don't, you will be criticized no matter what action you take.",
                "example_sentences": [
                    "He felt like he was damned if he did, and damned if he didn't, so he decided to follow his heart."
                ],
                "usage": "feel like he was damned if he did, and damned if he didn't",
                "Chinese": "感觉不管做还是不做都会受到批评",
                "regional_note": ""
            }
        ]
    ],
    "in the market": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you are in the market, you are actively buying or selling in a particular industry.",
                "example_sentences": [
                    "With the new product launch, we are now in the market for high-end headphones."
                ],
                "usage": "in the market for electronic vehicles",
                "Chinese": "在市场上销售电动汽车",
                "regional_note": ""
            }
        ]
    ],
    "will never fly": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you say an idea or plan will never fly, you mean it will never be successful.",
                "example_sentences": [
                    "His idea for a solar-powered toaster will never fly."
                ],
                "usage": "the plan that will never fly",
                "Chinese": "永远不会成功的计划",
                "regional_note": ""
            }
        ]
    ],
    "be here any minute": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If someone is going to be here any minute, they will arrive very soon.",
                "example_sentences": [
                    "The guests will be here any minute, so we need to finish setting the table."
                ],
                "usage": "the guests who will be here any minute",
                "Chinese": "马上就会到的客人",
                "regional_note": ""
            }
        ]
    ],
    "a brilliant idea": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A brilliant idea is an exceptionally clever or innovative thought or plan.",
                "example_sentences": [
                    "She had a brilliant idea to host a charity bake sale."
                ],
                "usage": "have a brilliant idea for the project",
                "Chinese": "为项目想出一个好主意",
                "regional_note": ""
            }
        ]
    ],
    "kick sb. out": [
        "",
        [
            {
                "part_of_speech": "phrase",
                "definition": "If you kick someone out, you force them to leave a place.",
                "example_sentences": [
                    "The landlord decided to kick him out for not paying the rent."
                ],
                "usage": "kick him out of the house because he didn't pay the rent",
                "Chinese": "因为他没交房租把他赶出房子",
                "regional_note": ""
            }
        ]
    ],
    "creep sb. out": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something creeps someone out, it makes them feel uneasy or frightened.",
                "example_sentences": [
                    "The old abandoned house really creeps me out."
                ],
                "usage": "the abandoned house that creeps me out",
                "Chinese": "让我感到毛骨悚然的荒废的房子",
                "regional_note": ""
            }
        ]
    ],
    "scare the heck out of sb.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something scares the heck out of someone, it frightens them very much.",
                "example_sentences": [
                    "The horror film scared the heck out of me."
                ],
                "usage": "the horror film that scared the heck out of me",
                "Chinese": "把我吓得要命的恐怖电影",
                "regional_note": ""
            }
        ]
    ],
    "fill sb. in": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you fill someone in, you give them all the details about something.",
                "example_sentences": [
                    "Can you fill me in on what happened at the meeting yesterday?"
                ],
                "usage": "ask her to fill me in on the details",
                "Chinese": "请她告诉我详细情况",
                "regional_note": ""
            }
        ]
    ],
    "a house warming gift": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A house warming gift is a present given to someone who has just moved into a new home.",
                "example_sentences": [
                    "We brought a bottle of wine as a house warming gift for our new neighbours."
                ],
                "usage": "bring a house warming gift for the new neighbours",
                "Chinese": "给新邻居带了一个礼物",
                "regional_note": ""
            }
        ]
    ],
    "I don't know if you've heard": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you say 'I don't know if you've heard', you are about to share some news or information that the listener might not be aware of.",
                "example_sentences": [
                    "I don't know if you've heard, but Jane is getting married next month."
                ],
                "usage": "I don't know if you've heard, but Jane is getting married next month",
                "Chinese": "我不知道你有没有听说，Jane下个月要结婚了",
                "regional_note": ""
            }
        ]
    ],
    "you'll never guess": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you say 'you'll never guess', you are about to reveal surprising or unexpected information.",
                "example_sentences": [
                    "You'll never guess who I ran into at the supermarket today!"
                ],
                "usage": "You'll never guess who I ran into at the supermarket today",
                "Chinese": "你肯定猜不到我今天在超市里碰到了谁",
                "regional_note": ""
            }
        ]
    ],
    "such a mess": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you describe something as 'such a mess', you mean it is very untidy or disorganised.",
                "example_sentences": [
                    "After the party, the living room was such a mess."
                ],
                "usage": "complains that the living room is such a mess",
                "Chinese": "抱怨客厅太乱了",
                "regional_note": ""
            }
        ]
    ],
    "chores": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "Chores are routine tasks or duties, especially those related to household maintenance.",
                "example_sentences": [
                    "Every Saturday morning, we all help with the household chores."
                ],
                "usage": "help with the household chores",
                "Chinese": "帮忙做家务",
                "regional_note": ""
            }
        ]
    ],
    "set the table": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you set the table, you arrange the cutlery, plates, and glasses in preparation for a meal.",
                "example_sentences": [
                    "Could you please set the table for dinner?"
                ],
                "usage": "set the table for dinner",
                "Chinese": "在晚饭前把餐具摆好",
                "regional_note": ""
            }
        ]
    ],
    "tidy up": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you tidy up, you make a place neat and orderly.",
                "example_sentences": [
                    "Let's tidy up the living room before our guests arrive."
                ],
                "usage": "tidy up the living room",
                "Chinese": "整理客厅",
                "regional_note": ""
            }
        ]
    ],
    "spotless": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something is spotless, it is completely clean and free from dirt or stains.",
                "example_sentences": [
                    "She keeps her kitchen absolutely spotless."
                ],
                "usage": "keep the kitchen spotless",
                "Chinese": "保持厨房一尘不染",
                "regional_note": ""
            }
        ]
    ],
    "in the middle of sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you are in the middle of something, you are busy doing it at the moment.",
                "example_sentences": [
                    "I'm in the middle of cooking dinner, can I call you back later?"
                ],
                "usage": "in the middle of cooking dinner",
                "Chinese": "正在做晚饭",
                "regional_note": ""
            }
        ]
    ],
    "hoover the house": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you hoover the house, you clean the floors using a vacuum cleaner.",
                "example_sentences": [
                    "I need to hoover the house before the guests arrive."
                ],
                "usage": "hoover the house before the guests arrive",
                "Chinese": "在客人到来之前用吸尘器打扫房子",
                "regional_note": ""
            }
        ]
    ],
    "on the blink": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something is on the blink, it is not working properly.",
                "example_sentences": [
                    "The television is on the blink again, so we might need to call the repairman."
                ],
                "usage": "the television that is on the blink",
                "Chinese": "快坏了的电视",
                "regional_note": ""
            }
        ]
    ],
    "ally oneself with": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you ally yourself with someone or something, you give your support to them.",
                "example_sentences": [
                    "During the debate, she decided to ally herself with the environmentalists to promote green policies."
                ],
                "usage": "ally himself with the protestors",
                "Chinese": "和抗议者站在一起",
                "regional_note": ""
            }
        ]
    ],
    "go on the rampage": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If a group of people go on the rampage, they rush about in a wild or violent way, causing damage or destruction.",
                "example_sentences": [
                    "After their team lost the match, some fans went on the rampage, breaking shop windows and overturning cars."
                ],
                "usage": "go on the rampage after the match",
                "Chinese": "比赛以后到处打砸",
                "regional_note": ""
            }
        ]
    ],
    "have pretensions to sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If someone has pretensions to something, they claim to have it or to be able to do it, even though this is not true.",
                "example_sentences": [
                    "He has pretensions to being a gourmet chef, but his cooking is quite basic."
                ],
                "usage": "have pretensions to be a gourmet chef",
                "Chinese": "自以为是美食大厨",
                "regional_note": ""
            }
        ]
    ],
    "bide one's time": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you bide your time, you wait quietly for a good opportunity before doing something.",
                "example_sentences": [
                    "She decided to bide her time and wait for the perfect moment to present her proposal."
                ],
                "usage": "bide his time and wait for the right moment to buy the stock",
                "Chinese": "等待合适的时机买股票",
                "regional_note": ""
            }
        ]
    ],
    "the length and breadth of sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you say that someone does something or something happens throughout or across the length and breadth of a place, you are emphasizing that it happens everywhere in that place.",
                "example_sentences": [
                    "The Queen's Jubilee was celebrated throughout the length and breadth of the United Kingdom."
                ],
                "usage": "travel the length and breadth of the country",
                "Chinese": "游遍全国",
                "regional_note": ""
            }
        ]
    ],
    "make a nuisance of oneself": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If someone makes a nuisance of themselves, they are behaving in an annoying way.",
                "example_sentences": [
                    "The children made a nuisance of themselves by running around the restaurant and disturbing other diners."
                ],
                "usage": "make a nuisance of themselves by running around the restaurant",
                "Chinese": "在餐厅里到处跑，让人讨厌",
                "regional_note": ""
            }
        ]
    ],
    "superficial injury": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A superficial injury is not very serious and only affects the surface of your body.",
                "example_sentences": [
                    "He sustained a superficial injury during the football match, which only required a plaster."
                ],
                "usage": "have a superficial injury after the football match",
                "Chinese": "在足球比赛后受了轻伤",
                "regional_note": ""
            }
        ]
    ],
    "multiple stores": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A multiple store is a shop with a lot of branches in different towns.",
                "example_sentences": [
                    "Marks & Spencer is a well-known multiple store with locations across the UK."
                ],
                "usage": "shop at the multiple store",
                "Chinese": "在连锁店买东西",
                "regional_note": ""
            }
        ]
    ],
    "see the error in one's ways": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If someone sees the error in their ways, they realise that their past behaviour or actions were wrong.",
                "example_sentences": [
                    "After a long conversation with his mentor, he finally saw the error in his ways and decided to apologise."
                ],
                "usage": "see the error in his ways and apologise",
                "Chinese": "认识到自己的错误并道歉",
                "regional_note": ""
            }
        ]
    ],
    "to the utmost": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you do something to the utmost, you do it to the greatest possible extent or degree.",
                "example_sentences": [
                    "She worked to the utmost to ensure the success of the charity event."
                ],
                "usage": "work to the utmost to ensure the success of the event",
                "Chinese": "尽最大努力确保活动的成功",
                "regional_note": ""
            }
        ]
    ],
    "in error": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something is done in error, it is done mistakenly or by accident.",
                "example_sentences": [
                    "The letter was sent to the wrong address in error."
                ],
                "usage": "the bill that is written in error",
                "Chinese": "写错了的账单",
                "regional_note": ""
            }
        ]
    ],
    "a twist in sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A twist in something is an unexpected and significant development.",
                "example_sentences": [
                    "The novel's plot had a surprising twist in the final chapter that left readers in awe."
                ],
                "usage": "don't expect the twist in the plot",
                "Chinese": "没有料到情节的转折",
                "regional_note": ""
            }
        ]
    ],
    "prostrate": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If someone is prostrate, they are so distressed or affected by a very bad experience that they are unable to do anything at all.",
                "example_sentences": [
                    "He was prostrate with grief after hearing the tragic news."
                ],
                "usage": "be prostrate with grief after hearing the news",
                "Chinese": "听到消息后悲痛欲绝",
                "regional_note": ""
            }
        ]
    ],
    "a bulge in sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If there is a bulge in something, there is a sudden large increase in it.",
                "example_sentences": [
                    "There was a noticeable bulge in the population after the war."
                ],
                "usage": "a bulge in the population after the war",
                "Chinese": "战后人口的显著增加",
                "regional_note": ""
            }
        ]
    ],
    "exact a high price": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something exacts a high price, it has a bad effect on a person or situation.",
                "example_sentences": [
                    "The long hours at work exacted a high price on his health."
                ],
                "usage": "the mistake that exacted a high price",
                "Chinese": "事后造成严重后果的错误",
                "regional_note": ""
            }
        ]
    ],
    "at one's beck and call": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If one person is at another's beck and call, they have to be constantly available and ready to do whatever is asked, and this often seems unfair or undesirable.",
                "example_sentences": [
                    "She felt like she was at her boss's beck and call, always having to respond to his demands."
                ],
                "usage": "at his boss's beck and call",
                "Chinese": "随时听从老板的吩咐",
                "regional_note": ""
            }
        ]
    ],
    "exact a revenge on sb.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If someone exacts revenge on a person, they have their revenge on them.",
                "example_sentences": [
                    "He vowed to exact revenge on those who had wronged him."
                ],
                "usage": "exact revenge on his manager for firing him",
                "Chinese": "报复解雇他的经理",
                "regional_note": ""
            }
        ]
    ],
    "a dispensation from sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If someone is given a dispensation from a rule or obligation, they are allowed not to follow it or carry it out.",
                "example_sentences": [
                    "The student received a dispensation from the final exam due to exceptional circumstances."
                ],
                "usage": "a dispensation from the final exam",
                "Chinese": "期末考试的豁免",
                "regional_note": ""
            }
        ]
    ],
    "in all likelihood": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you say that something will happen in all likelihood, you mean that it will probably happen.",
                "example_sentences": [
                    "In all likelihood, the match will be postponed due to the heavy rain."
                ],
                "usage": "the event that will be postponed in all likelihood",
                "Chinese": "很可能会推迟的活动",
                "regional_note": ""
            }
        ]
    ],
    "arrogate sth. to oneself": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If someone arrogates to themselves something such as a responsibility or privilege, they claim or take it even though they have no right to do so.",
                "example_sentences": [
                    "He arrogated to himself the authority to make decisions without consulting the committee."
                ],
                "usage": "arrogate to himself the authority to make decisions",
                "Chinese": "擅自做决定",
                "regional_note": ""
            }
        ]
    ],
    "in rotation": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If people do something in rotation, they take turns to do it.",
                "example_sentences": [
                    "The nurses worked in rotation to ensure that someone was always on duty."
                ],
                "usage": "work in rotation to keep the room clean",
                "Chinese": "轮流打扫房间",
                "regional_note": ""
            }
        ]
    ],
    "in debt": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If someone is in debt, it means they owe money to another person or institution.",
                "example_sentences": [
                    "After renovating his flat, John found himself in debt to the bank for quite a sum."
                ],
                "usage": "the entropreneur who is deep in debt",
                "Chinese": "深陷债务的公司老板",
                "regional_note": ""
            }
        ]
    ],
    "broke": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If someone is broke, it means they have no money at all.",
                "example_sentences": [
                    "Having spent his last quid on a pint, Tom was completely broke until payday."
                ],
                "usage": "find out that his husband is broke",
                "Chinese": "发现丈夫身无分文",
                "regional_note": ""
            }
        ]
    ],
    "hit sb. pretty hard": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something hits someone pretty hard, it means it affects them very negatively or severely.",
                "example_sentences": [
                    "The closure of the local factory hit the village pretty hard, leaving many unemployed."
                ],
                "usage": "the news that hit the family pretty hard",
                "Chinese": "让全家感到很沮丧的消息",
                "regional_note": ""
            }
        ]
    ],
    "tuition": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "Tuition is the money paid for instruction, especially at a university or college.",
                "example_sentences": [
                    "Despite the high tuition fees, Oxbridge remains a popular choice for many British students."
                ],
                "usage": "pay the tuition fees for the course",
                "Chinese": "支付课程的学费",
                "regional_note": ""
            }
        ]
    ],
    "take out a loan": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you take out a loan, it means you borrow money from a bank or other financial institution.",
                "example_sentences": [
                    "Sarah had to take out a loan to cover the deposit on her new flat in London."
                ],
                "usage": "take out a loan to buy the new flat",
                "Chinese": "为了买新房子而借贷",
                "regional_note": ""
            }
        ]
    ],
    "trouble sb.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you trouble someone, it means you inconvenience them by asking for help or assistance.",
                "example_sentences": [
                    "Might I trouble you for a spot of tea, if it's not too much bother?"
                ],
                "usage": "ask him if I can trouble him for a lift",
                "Chinese": "问他能不能搭他的车",
                "regional_note": ""
            }
        ]
    ],
    "on top of all that": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something happens on top of all that, it means it occurs in addition to other things, usually unpleasant ones.",
                "example_sentences": [
                    "The train was delayed, it started raining, and on top of all that, I lost my umbrella."
                ],
                "usage": "complain about the delay, the rain, and on top of all that, losing the umbrella",
                "Chinese": "抱怨火车晚点，下雨，还丢了伞",
                "regional_note": ""
            }
        ]
    ],
    "knock over sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you knock over something, it means you accidentally hit it, causing it to fall.",
                "example_sentences": [
                    "In his rush to catch the bus, James knocked over the vase of flowers on the hall table."
                ],
                "usage": "knock over the chair",
                "Chinese": "把椅子弄倒",
                "regional_note": ""
            }
        ]
    ],
    "knock over sb.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you knock over someone, it means you accidentally collide with them, causing them to fall.",
                "example_sentences": [
                    "The excited Labrador knocked over the postman as he came through the garden gate."
                ],
                "usage": "knock over the postman",
                "Chinese": "撞倒邮递员",
                "regional_note": ""
            }
        ]
    ],
    "place": [
        "",
        [
            {
                "part_of_speech": "phrase",
                "definition": "Someone's place is their home or residence.",
                "example_sentences": [
                    "After the pub quiz, we all went back to Mary's place for a nightcap."
                ],
                "usage": "come over to my place for dinner",
                "Chinese": "到我家来吃晚饭",
                "regional_note": ""
            }
        ]
    ],
    "feel terrible": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you feel terrible, it means you experience strong feelings of guilt, regret, or physical discomfort.",
                "example_sentences": [
                    "I feel terrible about forgetting Granny's birthday; I must send her a card straightaway."
                ],
                "usage": "feel terrible about forgetting the birthday",
                "Chinese": "因为忘记生日而感到内疚",
                "regional_note": ""
            }
        ]
    ],
    "don't mean to": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you say you don't mean to do something, it indicates that your action was unintentional.",
                "example_sentences": [
                    "I don't mean to be a bother, but could you possibly turn down the wireless a tad?"
                ],
                "usage": "don't mean to interrupt you",
                "Chinese": "不是故意打扰你",
                "regional_note": ""
            }
        ]
    ],
    "a tilt at sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A tilt at something is an attempt or effort to achieve or accomplish it.",
                "example_sentences": [
                    "After years of dreaming, Nigel finally decided to have a tilt at writing his first novel."
                ],
                "usage": "have a tilt at writing the first novel",
                "Chinese": "尝试写第一部小说",
                "regional_note": ""
            }
        ]
    ],
    "shudder to think": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you shudder to think about something, you feel very worried or frightened when you consider it.",
                "example_sentences": [
                    "I shudder to think what might have happened if we hadn't installed a smoke alarm in the flat."
                ],
                "usage": "shudder to think about the consequences",
                "Chinese": "不敢想象后果",
                "regional_note": ""
            }
        ]
    ],
    "take a plunge": [
        "",
        [
            {
                "part_of_speech": "phrase",
                "definition": "If you take a plunge, you decide to do something important or risky after thinking about it for a long time.",
                "example_sentences": [
                    "After years of hesitation, Nigel finally took the plunge and proposed to his long-time girlfriend during afternoon tea."
                ],
                "usage": "take the plunge and invest in the company",
                "Chinese": "下定决心投资公司",
                "regional_note": ""
            }
        ]
    ],
    "send a shudder through sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something sends a shudder through a group of people, it makes them feel very frightened or worried.",
                "example_sentences": [
                    "The announcement of potential redundancies sent a shudder through the entire workforce at the biscuit factory."
                ],
                "usage": "send a shudder through the cabinet",
                "Chinese": "让内阁感到不安",
                "regional_note": ""
            }
        ]
    ],
    "make a left": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "When you make a left while driving, you turn left.",
                "example_sentences": [
                    "To get to the local pub, make a left at the roundabout and continue straight for about half a mile."
                ],
                "usage": "make a left at the next junction",
                "Chinese": "在下一个路口左转",
                "regional_note": ""
            }
        ]
    ],
    "step on it": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "When you tell someone to step on it when they are driving, you are telling them to drive faster.",
                "example_sentences": [
                    "We're late for the cricket match! Step on it, would you?"
                ],
                "usage": "step on it to get to the match on time",
                "Chinese": "车开快点以便准时到达比赛",
                "regional_note": ""
            }
        ]
    ],
    "have a fit": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If someone has a fit, they become very angry or upset.",
                "example_sentences": [
                    "Mum will have a fit if she sees the state of the kitchen after our attempt at making Yorkshire puddings."
                ],
                "usage": "have a fit when she sees the mess in the kitchen",
                "Chinese": "看到厨房一片狼藉以后大发雷霆",
                "regional_note": ""
            }
        ]
    ],
    "cut through": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you cut through a place, you go through it to get to another place quickly.",
                "example_sentences": [
                    "Let's cut through the park to reach the high street; it'll save us a good five minutes."
                ],
                "usage": "cut through the park",
                "Chinese": "穿过公园",
                "regional_note": ""
            }
        ]
    ],
    "short cut": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you take a short cut, you go a quicker way than the usual way.",
                "example_sentences": [
                    "I know a brilliant short cut to avoid the queue on the motorway; it goes past a lovely old manor house."
                ],
                "usage": "take a short cut to avoid the traffic",
                "Chinese": "走捷径避开交通堵塞",
                "regional_note": ""
            }
        ]
    ],
    "run a red light": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you run a red light, you drive through a red traffic light.",
                "example_sentences": [
                    "The lorry driver nearly ran a red light at the busy junction, causing pedestrians to leap back onto the pavement."
                ],
                "usage": "run a red light at the junction",
                "Chinese": "在十字路口闯红灯",
                "regional_note": ""
            }
        ]
    ],
    "are you nuts": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you say to someone 'Are you nuts?' you are asking them if they are crazy.",
                "example_sentences": [
                    "Are you nuts? You can't wear trainers to a formal garden party at Buckingham Palace!"
                ],
                "usage": "can't help but yell 'Are you nuts?'",
                "Chinese": "忍不住大喊“你疯了吗？”",
                "regional_note": ""
            }
        ]
    ],
    "side street": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A side street is a small street that is connected to a main street.",
                "example_sentences": [
                    "We found a charming little tea shop tucked away in a side street off the bustling high street."
                ],
                "usage": "walk down the side street",
                "Chinese": "沿着小巷走",
                "regional_note": ""
            }
        ]
    ],
    "take the street": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you take the street, you walk or drive along the street.",
                "example_sentences": [
                    "To get to the local chippy, take the street on your left and continue past the old red telephone box."
                ],
                "usage": "take the street and turn left",
                "Chinese": "沿着这条路走然后左转",
                "regional_note": ""
            }
        ]
    ],
    "road rage": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you have road rage, you become very angry at other drivers when you are driving.",
                "example_sentences": [
                    "The gentleman in the Aston Martin displayed alarming road rage when another driver failed to indicate at the mini-roundabout."
                ],
                "usage": "display constant road rage",
                "Chinese": "一个劲对别的司机发火",
                "regional_note": ""
            }
        ]
    ],
    "back up": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you back up, you drive backwards.",
                "example_sentences": [
                    "Could you please back up a bit? I'm having trouble getting out of this tight parking space near the village green."
                ],
                "usage": "back up to get out of the parking space",
                "Chinese": "倒车离开停车位",
                "regional_note": ""
            }
        ]
    ],
    "groom": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A groom is the man who is getting married in a wedding ceremony.",
                "example_sentences": [
                    "The groom nervously adjusted his bow tie as he waited for his bride at the altar."
                ],
                "usage": "a nervous groom",
                "Chinese": "紧张的新郎",
                "regional_note": ""
            }
        ]
    ],
    "bride": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A bride is the woman who is getting married in a wedding ceremony.",
                "example_sentences": [
                    "The bride looked radiant as she walked down the aisle in her white gown."
                ],
                "usage": "a beautiful bride",
                "Chinese": "美丽的新娘",
                "regional_note": ""
            }
        ]
    ],
    "it's about time": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "When you say it's about time, you mean that something should have happened a long time ago.",
                "example_sentences": [
                    "It's about time the council fixed those potholes on the high street!"
                ],
                "usage": "say it's about time to tidy up the garden",
                "Chinese": "表示是时候整理花园了",
                "regional_note": ""
            }
        ]
    ],
    "aisle": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "An aisle is a long narrow gap that people walk along between rows of seats in a public building such as a church or theatre.",
                "example_sentences": [
                    "The ushers guided guests to their seats along the flower-decorated aisle."
                ],
                "usage": "sit in the aisle seat",
                "Chinese": "坐在过道座位上",
                "regional_note": ""
            }
        ]
    ],
    "bridesmaid": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A bridesmaid is a female friend or relative who helps the bride at a wedding.",
                "example_sentences": [
                    "Sarah chose her sister as her chief bridesmaid for the big day."
                ],
                "usage": "ask her sister to be the bridesmaid",
                "Chinese": "请她的姐姐做伴娘",
                "regional_note": ""
            }
        ]
    ],
    "flower girl": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A flower girl is a girl at a wedding that throws flower petals down the aisle",
                "example_sentences": [
                    "Little Emily, the flower girl, scattered rose petals as she walked ahead of the bride."
                ],
                "usage": "ask Emily to be the flower girl",
                "Chinese": "请Emily做花童",
                "regional_note": ""
            }
        ]
    ],
    "ring bearer": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A ring bearer is a boy at a wedding that holds the wedding rings.",
                "example_sentences": [
                    "The young ring bearer carefully carried the cushion with the rings down the aisle."
                ],
                "usage": "ask the nephew to be the ring bearer",
                "Chinese": "请侄子做戒指童",
                "regional_note": ""
            }
        ]
    ],
    "gorgeous": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you say that something is gorgeous, you mean that it is very beautiful or attractive.",
                "example_sentences": [
                    "The bride's dress was absolutely gorgeous, with intricate lace detailing."
                ],
                "usage": "a gorgeous hall for the wedding",
                "Chinese": "漂亮的婚礼大厅",
                "regional_note": ""
            }
        ]
    ],
    "groomsman": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A groomsman is a male friend or relative who helps the groom on the wedding day.",
                "example_sentences": [
                    "James asked his university flatmates to be his groomsmen at the wedding."
                ],
                "usage": "invite his best friend to be the groomsmen",
                "Chinese": "邀请他最好的朋友做伴郎",
                "regional_note": ""
            }
        ]
    ],
    "go bankrupt": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If a person or company goes bankrupt, they are unable to pay their debts and are legally declared to be in financial ruin.",
                "example_sentences": [
                    "The local pub went bankrupt after struggling through the economic downturn."
                ],
                "usage": "go bankrupt after being bailed out",
                "Chinese": "在获得救助后破产",
                "regional_note": ""
            }
        ]
    ],
    "bail out": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If a person or company is bailed out, they receive help to escape a difficult situation, often financial.",
                "example_sentences": [
                    "The government had to bail out several banks during the financial crisis, much to the chagrin of many taxpayers."
                ],
                "usage": "bail out the company after the financial crisis",
                "Chinese": "在金融危机后救助公司",
                "regional_note": ""
            }
        ]
    ],
    "injustice": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "Injustice is a lack of fairness or equity in a situation.",
                "example_sentences": [
                    "The inequality in school funding across different boroughs was seen as a glaring injustice by many parents and teachers."
                ],
                "usage": "the injustice of the system",
                "Chinese": "制度的不公平",
                "regional_note": ""
            }
        ]
    ],
    "mismanaged": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something is mismanaged, it is handled or organised in an incompetent or improper manner.",
                "example_sentences": [
                    "The council's mismanaged bin collection schedule left rubbish piling up on the streets for weeks."
                ],
                "usage": "the mismanaged company",
                "Chinese": "管理不善的公司",
                "regional_note": ""
            }
        ]
    ],
    "have the nerve to": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you say that someone has the nerve to do something, you mean they behave in a way you find remarkably bold or impertinent.",
                "example_sentences": [
                    "I couldn't believe he had the nerve to ask for a pay rise after turning up late to work every day this week!"
                ],
                "usage": "have the nerve to ask for a pay rise",
                "Chinese": "有胆量去要求加薪",
                "regional_note": ""
            }
        ]
    ],
    "make several millions": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If someone makes several millions, they earn a very large amount of money, typically in the millions of pounds.",
                "example_sentences": [
                    "The footballer was rumoured to make several millions each year from his lucrative endorsement deals."
                ],
                "usage": "make several millions from the endorsement deals",
                "Chinese": "通过代言合同赚取数百万",
                "regional_note": ""
            }
        ]
    ],
    "placard": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A placard is a large sign or notice, often carried during public demonstrations or displayed in prominent places.",
                "example_sentences": [
                    "The striking workers marched through the city centre, holding placards that demanded better working conditions."
                ],
                "usage": "hold a placard that demands better working conditions",
                "Chinese": "举着要求更好工作条件的标语牌",
                "regional_note": ""
            }
        ]
    ],
    "rally": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A rally is a large public gathering held to show support for a cause or political party.",
                "example_sentences": [
                    "Thousands attended the rally in Trafalgar Square to protest against the proposed changes to the NHS."
                ],
                "usage": "attend the rally to support the candidate",
                "Chinese": "参加集会支持候选人",
                "regional_note": ""
            }
        ]
    ],
    "proponent": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A proponent is a person who advocates for or supports a particular idea, policy, or course of action.",
                "example_sentences": [
                    "As a staunch proponent of free school meals, the MP argued passionately for the programme's expansion in Parliament."
                ],
                "usage": "a proponent of the free school meals",
                "Chinese": "免费学校午餐的支持者",
                "regional_note": ""
            }
        ]
    ],
    "stick one's head out of the window": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you stick your head out of a window, you put your head outside through an open window.",
                "example_sentences": [
                    "As the steam train pulled into the station, eager children stuck their heads out of the windows to catch a glimpse of the platform."
                ],
                "usage": "stick his head out of the window and wave to the crowd",
                "Chinese": "把头伸出窗外向人群挥手",
                "regional_note": ""
            }
        ]
    ],
    "PA announcement": [
        "",
        [
            {
                "part_of_speech": "phrase",
                "definition": "A PA announcement is a message broadcast over a public address system in a public place.",
                "example_sentences": [
                    "The PA announcement at Tesco reminded shoppers that the store would be closing in fifteen minutes."
                ],
                "usage": "pay attention to the PA announcement",
                "Chinese": "注意听广播通知",
                "regional_note": ""
            }
        ]
    ],
    "across from": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something is across from another thing, it is on the opposite side of a space or street.",
                "example_sentences": [
                    "The local pub is across from the village green, making it a popular spot for a pint after a game of cricket."
                ],
                "usage": "the pub across from the church",
                "Chinese": "教堂对面的酒吧",
                "regional_note": ""
            }
        ]
    ],
    "in the proximity of": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something is in the proximity of a place, it is near or close to that location.",
                "example_sentences": [
                    "The bed and breakfast was in the proximity of Stonehenge, allowing guests to easily visit the ancient monument."
                ],
                "usage": "the hotel in the proximity of the airport",
                "Chinese": "机场附近的酒店",
                "regional_note": ""
            }
        ]
    ],
    "watch sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you watch something, you look after or keep an eye on it, often to prevent theft or damage.",
                "example_sentences": [
                    "Could you watch my shopping trolley while I pop to the loo?"
                ],
                "usage": "watch the bags while she goes to the loo",
                "Chinese": "在她上厕所时看着包",
                "regional_note": ""
            }
        ]
    ],
    "the exploit of sb.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "An exploit is a daring or adventurous act or feat, often involving bravery or skill.",
                "example_sentences": [
                    "The exploits of Sir Francis Drake, including his circumnavigation of the globe, are still celebrated in British history."
                ],
                "usage": "the exploits of the general",
                "Chinese": "将军的英勇事迹",
                "regional_note": ""
            }
        ]
    ],
    "cash in the empties": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "When you cash in the empties, you return empty bottles or cans to a shop in order to get money back.",
                "example_sentences": [
                    "After the weekend party, I cashed in the empties and used the money to buy some crisps."
                ],
                "usage": "forget to cash in the empties",
                "Chinese": "忘记把空瓶子换成钱",
                "regional_note": ""
            }
        ]
    ],
    "pay a deposit": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "When you pay a deposit, you pay a sum of money as a guarantee that you will return something in good condition.",
                "example_sentences": [
                    "I had to pay a deposit when I rented the flat in London."
                ],
                "usage": "pay a deposit for the flat",
                "Chinese": "为房子付押金",
                "regional_note": ""
            }
        ]
    ],
    "get down to brass tacks": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "When you get down to brass tacks, you start talking about the most important or basic facts of a situation.",
                "example_sentences": [
                    "Let's get down to brass tacks and discuss the menu for the Queen's Jubilee celebration."
                ],
                "usage": "get down to brass tacks and talk about the plan for the party",
                "Chinese": "回到正题讨论派对的计划",
                "regional_note": ""
            }
        ]
    ],
    "defy sb. to do sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "When you defy someone to do something, you challenge them to do it.",
                "example_sentences": [
                    "He defied his mates to finish the Yorkshire pudding challenge."
                ],
                "usage": "defy him to eat the whole cake",
                "Chinese": "赌他不能吃完整个蛋糕",
                "regional_note": ""
            }
        ]
    ],
    "a deluge of sth.": [
        "",
        [
            {
                "part_of_speech": "phrase",
                "definition": "A deluge of something is a large amount of it arriving at the same time.",
                "example_sentences": [
                    "After the Wimbledon match, we received a deluge of emails from excited fans."
                ],
                "usage": "a deluge of emails",
                "Chinese": "一大堆邮件",
                "regional_note": ""
            }
        ]
    ],
    "at room temperature": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something is at room temperature, its temperature is neither hot nor cold.",
                "example_sentences": [
                    "The scones are best served at room temperature with a dollop of clotted cream."
                ],
                "usage": "make the steak at room temperature",
                "Chinese": "让牛排达到室温",
                "regional_note": ""
            }
        ]
    ],
    "hurl abuse at sb.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "When you hurl abuse at someone, you shout insults at them.",
                "example_sentences": [
                    "The football fans began to hurl abuse at the referee after the controversial call."
                ],
                "usage": "hurl abuse at the referee",
                "Chinese": "对裁判大声辱骂",
                "regional_note": ""
            }
        ]
    ],
    "be hounded out of a job": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If someone is hounded out of a job, they are forced to leave it because people make it impossible for them to stay.",
                "example_sentences": [
                    "The MP was hounded out of his job following the scandal."
                ],
                "usage": "be hounded out of the job after the scandal",
                "Chinese": "在丑闻后被迫离职",
                "regional_note": ""
            }
        ]
    ],
    "a tyranny of sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A tyranny of something is a situation in which there is too much of it, usually something unpleasant.",
                "example_sentences": [
                    "The tyranny of rain during the summer festival was disheartening."
                ],
                "usage": "deal with a tyranny of inquires",
                "Chinese": "应付一大堆的询问",
                "regional_note": ""
            }
        ]
    ],
    "defy all comprehension": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something defies all comprehension, it is so strange or difficult that it is impossible to understand.",
                "example_sentences": [
                    "The complex rules of cricket defy all comprehension for some."
                ],
                "usage": "the situation defying all comprehension",
                "Chinese": "让人难以理解的情况",
                "regional_note": ""
            }
        ]
    ],
    "one's spirits soar": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If someone's spirits soar, they suddenly feel very happy or excited.",
                "example_sentences": [
                    "His spirits soared when he saw the fish and chips sign on the seaside."
                ],
                "usage": "calm down after seeing his son's spirits soar",
                "Chinese": "看到儿子非常高兴以后才冷静下来",
                "regional_note": ""
            }
        ]
    ],
    "impute sth. to sb.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you impute something to someone, you say that they are responsible for it.",
                "example_sentences": [
                    "The report imputed the failure to the project manager."
                ],
                "usage": "impute the failure to the project manager",
                "Chinese": "把失败归咎于项目经理",
                "regional_note": ""
            }
        ]
    ],
    "refund sb. with sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If a seller refunds you with something, you obtain that thing as a refund.",
                "example_sentences": [
                    "The shop agreed to refund me with a store voucher for the faulty item."
                ],
                "usage": "refund the customer with a store voucher",
                "Chinese": "用商店礼券退款给顾客",
                "regional_note": ""
            }
        ]
    ],
    "be secretive about sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If someone is secretive about something, they do not want to talk about it or share information about it.",
                "example_sentences": [
                    "She was secretive about her recipe for the perfect Victoria sponge cake."
                ],
                "usage": "be secretive about his past",
                "Chinese": "对他的过去保密",
                "regional_note": ""
            }
        ]
    ],
    "out of all proportion to sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you think A is out of all proportion to B, you think A is much larger or smaller than it should be in relation to B.",
                "example_sentences": [
                    "The queue for the royal wedding was out of all proportion to the event's capacity."
                ],
                "usage": "out of all proportion to what is needed",
                "Chinese": "远远超过所需要的",
                "regional_note": ""
            }
        ]
    ],
    "to the accompaniment of": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "When something happens to the accompaniment of something else, it happens at the same time as the other thing.",
                "example_sentences": [
                    "The Queen's Guard marched to the accompaniment of a traditional military band."
                ],
                "usage": "go home to the accompaniment of the rain",
                "Chinese": "在雨中回家",
                "regional_note": ""
            }
        ]
    ],
    "in quantity": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "Things that are produced in quantity are produced in large numbers.",
                "example_sentences": [
                    "The bakery bakes scones in quantity for the afternoon tea at Buckingham Palace."
                ],
                "usage": "produce the new product in quantity",
                "Chinese": "大量生产新产品",
                "regional_note": ""
            }
        ]
    ],
    "be a disgrace": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you say that something is a disgrace, you are emphasising that it is very bad or wrong, and that you find it completely unacceptable.",
                "example_sentences": [
                    "It's a disgrace that some people still litter in our beautiful national parks."
                ],
                "usage": "agree that the business is indeed a disgrace",
                "Chinese": "同意这家公司的确让人无法接受",
                "regional_note": ""
            }
        ]
    ],
    "pass the baton to sb.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you pass the baton to someone, you give them responsibility for something that you have been doing.",
                "example_sentences": [
                    "The headmaster passed the baton to the deputy head after 30 years of service."
                ],
                "usage": "pass the baton to the son",
                "Chinese": "把公司经营权传给儿子",
                "regional_note": ""
            }
        ]
    ],
    "leave a scar on sb.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If an event or experience leaves a scar on someone, it has a lasting negative effect on them.",
                "example_sentences": [
                    "The loss of his pet dog left a scar on the young boy, making him fearful of forming attachments."
                ],
                "usage": "leave a scar on the young boy",
                "Chinese": "给小男孩留下阴影",
                "regional_note": ""
            }
        ]
    ],
    "preferential treatment": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you get preferential treatment, you are treated better than other people in the same situation.",
                "example_sentences": [
                    "Members of Parliament receive preferential treatment when booking tours of the Houses of Parliament."
                ],
                "usage": "receive preferential treatment",
                "Chinese": "受到优待",
                "regional_note": ""
            }
        ]
    ],
    "a hoard of": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A hoard of things is a large amount of them that someone has kept in a secret place.",
                "example_sentences": [
                    "The antique dealer found a hoard of vintage postage stamps in the attic of an old manor house."
                ],
                "usage": "discover a hoard of coins",
                "Chinese": "发现一大堆硬币",
                "regional_note": ""
            }
        ]
    ],
    "a specimen of": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A specimen of something is an example of it that shows what it is like.",
                "example_sentences": [
                    "The museum displayed a specimen of the first computer ever built, showcasing its size and complexity."
                ],
                "usage": "display a specimen of the first computer",
                "Chinese": "展示第一台计算机的样品",
                "regional_note": ""
            }
        ]
    ],
    "a literal person": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you describe someone as a literal person, you mean that they interpret words in their exact and most basic sense.",
                "example_sentences": [
                    "John is a literal person, so when you tell him to 'break a leg', he might get confused and worry about actual physical harm."
                ],
                "usage": "turn out to be a literal person",
                "Chinese": "原来是个不懂得变通的人",
                "regional_note": ""
            }
        ]
    ],
    "exact": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you exact something such as a promise or a punishment, you demand that it be done or given.",
                "example_sentences": [
                    "The headmaster exacted a written apology from the mischievous pupil."
                ],
                "usage": "exact a promise his husband",
                "Chinese": "要求他的丈夫兑现承诺",
                "regional_note": ""
            }
        ]
    ],
    "a flame": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A flame is an email message that is angry, critical, or accusatory in tone.",
                "example_sentences": [
                    "After posting a controversial opinion online, my inbox was flooded with flames from disgruntled readers."
                ],
                "usage": "receive a flame from the reader",
                "Chinese": "收到一封来自读者的用来泄愤的邮件",
                "regional_note": ""
            }
        ]
    ],
    "radio network": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A radio network is a company or group of companies that broadcasts radio throughout an area.",
                "example_sentences": [
                    "The BBC is a well-known radio network that reaches listeners across the United Kingdom."
                ],
                "usage": "build a radio network",
                "Chinese": "创办一家广播公司",
                "regional_note": ""
            }
        ]
    ],
    "network with sb.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you network with people, you talk to them and exchange information with them, especially in order to get work or to make business contacts.",
                "example_sentences": [
                    "At the charity gala, I had the opportunity to network with several influential members of Parliament."
                ],
                "usage": "network with the influential members of Parliament",
                "Chinese": "与有影响力的议员建立联系",
                "regional_note": ""
            }
        ]
    ],
    "be specific about sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you are specific about something, you give details or a clear description of it.",
                "example_sentences": [
                    "When ordering tea at a café, it's best to be specific about how you like it prepared."
                ],
                "usage": "be specific about the requirements",
                "Chinese": "说清楚要求",
                "regional_note": ""
            }
        ]
    ],
    "walk down the aisle": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you walk down the aisle, you get married.",
                "example_sentences": [
                    "The bride walked down the aisle of Westminster Abbey, her dress trailing behind her."
                ],
                "usage": "be about to walk down the aisle",
                "Chinese": "马上就要结婚了",
                "regional_note": ""
            }
        ]
    ],
    "be groomed for sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you are groomed for a particular job or position, someone prepares you for it by teaching you the necessary skills and giving you the necessary experience.",
                "example_sentences": [
                    "As the eldest son of the Duke, he was groomed for a life of royal duties from an early age."
                ],
                "usage": "be groomed for the higher position",
                "Chinese": "为升职做准备",
                "regional_note": ""
            }
        ]
    ],
    "walk past sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you walk past a place, you walk near it or next to it without stopping.",
                "example_sentences": [
                    "I often walk past Buckingham Palace on my way to work in central London."
                ],
                "usage": "walk past the supermarket",
                "Chinese": "经过超市",
                "regional_note": ""
            }
        ]
    ],
    "move by sb.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If a vehicle moves by someone, it passes them.",
                "example_sentences": [
                    "The red double-decker bus moved by me as I waited at the zebra crossing."
                ],
                "usage": "move by the old man",
                "Chinese": "经过那个老人",
                "regional_note": ""
            }
        ]
    ],
    "be a mouthful": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If a word is a mouthful, it is long and difficult to say.",
                "example_sentences": [
                    "The name of that Welsh village is certainly a mouthful!"
                ],
                "usage": "find the Asian names always a mouthful",
                "Chinese": "总觉得亚洲名字很难念对",
                "regional_note": ""
            }
        ]
    ],
    "browse the aisles": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you browse the aisles when you are shopping, you walk slowly up and down the aisles looking at things.",
                "example_sentences": [
                    "I love to browse the aisles of Harrods, even if I can't afford to buy anything."
                ],
                "usage": "browse the aisles of the supermarket",
                "Chinese": "在超市里走马观花",
                "regional_note": ""
            }
        ]
    ],
    "a walk in the park": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you describe something as a walk in the park, you mean that it is very easy to do.",
                "example_sentences": [
                    "Compared to last year's exam, this one was a walk in the park."
                ],
                "usage": "only to find out that the interview was a walk in the park",
                "Chinese": "结果发现面试很简单",
                "regional_note": ""
            }
        ]
    ],
    "plump for sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you plump for something, you choose it from a number of possibilities.",
                "example_sentences": [
                    "After much deliberation over the menu, I finally plumped for the traditional fish and chips."
                ],
                "usage": "plump for the Italian restaurant",
                "Chinese": "选择去意大利餐厅",
                "regional_note": ""
            }
        ]
    ],
    "beyond redemption": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you say that someone or something is beyond redemption, you mean that they are so bad that they cannot be helped or improved in any way.",
                "example_sentences": [
                    "After the politician's third scandal, many voters considered him beyond redemption and called for his resignation."
                ],
                "usage": "consider the student beyond redemption",
                "Chinese": "认为这个学生无药可救",
                "regional_note": ""
            }
        ]
    ],
    "be reminiscent of sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you say that A is reminiscent of B, you mean that A reminds you of B because of some similarity between them.",
                "example_sentences": [
                    "The quaint village pub was reminiscent of those found in Agatha Christie novels."
                ],
                "usage": "be reminiscent of the old days",
                "Chinese": "让人想起过去的日子",
                "regional_note": ""
            }
        ]
    ],
    "appoint": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you appoint someone to a job or official position, you formally choose them for it.",
                "example_sentences": [
                    "The Queen appointed a new Prime Minister following the general election."
                ],
                "usage": "appoint a new manager",
                "Chinese": "任命一位新经理",
                "regional_note": ""
            }
        ]
    ],
    "step out of": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you step out of a place, you leave it.",
                "example_sentences": [
                    "As I stepped out of the tube station, I was greeted by the bustling streets of London."
                ],
                "usage": "step out of the tube station",
                "Chinese": "走出地铁站",
                "regional_note": ""
            }
        ]
    ],
    "step in": [
        "",
        [
            {
                "part_of_speech": "phrase",
                "definition": "If you step in a place, you enter it.",
                "example_sentences": [
                    "Please step in the drawing room; I'll fetch us some tea."
                ],
                "usage": "step in the museum",
                "Chinese": "进入博物馆",
                "regional_note": ""
            }
        ]
    ],
    "get a load of sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you ask someone to get a load of something, you are asking them to look at it or listen to it.",
                "example_sentences": [
                    "Get a load of that chap's bowler hat; it's absolutely enormous!"
                ],
                "usage": "come and get a load of the new car",
                "Chinese": "来看看新车",
                "regional_note": ""
            }
        ]
    ],
    "pay heed to sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you pay heed to someone or something, you pay attention to them and consider carefully what they say.",
                "example_sentences": [
                    "The council would do well to pay heed to the residents' concerns about the new motorway."
                ],
                "usage": "pay heed to the warning",
                "Chinese": "把警告当回事",
                "regional_note": ""
            }
        ]
    ],
    "take one's temperature": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you take someone's temperature, you measure it using a thermometer in order to find out if they have a fever.",
                "example_sentences": [
                    "The school nurse took Johnny's temperature to see if he needed to be sent home."
                ],
                "usage": "take the patient's temperature",
                "Chinese": "给病人量体温",
                "regional_note": ""
            }
        ]
    ],
    "ingratiate oneself with sb.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you ingratiate yourself with someone, you do things to try and make them like you.",
                "example_sentences": [
                    "The new employee attempted to ingratiate himself with the manager by offering to work overtime."
                ],
                "usage": "ingratiate himself with the manager",
                "Chinese": "讨好经理",
                "regional_note": ""
            }
        ]
    ],
    "be blasé about sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you are blasé about something, you are not impressed, excited, or worried about it because you have seen or experienced it many times before.",
                "example_sentences": [
                    "Having lived in central London for years, Sarah was rather blasé about seeing celebrities in the street."
                ],
                "usage": "be blasé about the new generation of iPhones",
                "Chinese": "对新一代的iPhone不感到新奇",
                "regional_note": ""
            }
        ]
    ],
    "one's patter about sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "Someone's patter about something is a series of things that they say quickly and easily, usually in order to entertain people or to persuade them to buy something.",
                "example_sentences": [
                    "The market stallholder's patter about his wares was so convincing that many people couldn't resist buying."
                ],
                "usage": "have to stand his patter about the new product",
                "Chinese": "不得不忍受听他对新产品不停地吹嘘",
                "regional_note": ""
            }
        ]
    ],
    "a coup": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A coup is an achievement which is thought to be especially good because it is very difficult.",
                "example_sentences": [
                    "Winning the contract with the prestigious client was a real coup for the small firm."
                ],
                "usage": "be a real coup for the small firm",
                "Chinese": "对小公司来说是一大成功",
                "regional_note": ""
            }
        ]
    ],
    "literature from someone": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "The literature from someone is the written information from people who want to sell you something or give you advice.",
                "example_sentences": [
                    "The sales representative handed out some literature about the new product range to all the attendees.",
                    "We expect to receive the literature from the company about the new software."
                ],
                "usage": "hand out the literature from the company",
                "Chinese": "分发关于这家公司的宣传资料",
                "regional_note": ""
            }
        ]
    ],
    "in the belief": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you do something in the belief that something is true, you do it because you think it is true.",
                "example_sentences": [
                    "She accepted the job offer in the belief that it would lead to better career prospects."
                ],
                "usage": "come to the party in the belief that it would be fun",
                "Chinese": "来参加派对，希望这个派对会很有趣",
                "regional_note": ""
            }
        ]
    ],
    "networked": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "When a television or radio programme is networked, it is broadcast simultaneously by all the television or radio stations in a country.",
                "example_sentences": [
                    "The Queen's Christmas message is always networked across all major television channels in the UK."
                ],
                "usage": "the Queen's Christmas message that has been networked across all major television channels",
                "Chinese": "英国所有主要电视台都已经播出的女王圣诞致辞",
                "regional_note": ""
            }
        ]
    ],
    "a stroke of luck": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A stroke of luck or good fortune is something lucky that happens to you.",
                "example_sentences": [
                    "Finding a parking space right outside the theatre was a real stroke of luck on a busy Saturday night."
                ],
                "usage": "gain a lot of money from the stock market with a stroke of luck",
                "Chinese": "凭运气在股市赚了一大笔钱",
                "regional_note": ""
            }
        ]
    ],
    "of necessity": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you say that something is of necessity the case, you mean that it is the case because nothing else is possible or practical in the circumstances.",
                "example_sentences": [
                    "Negotiations between the two sides are of necessity indirect."
                ],
                "usage": "the negotiations that are of necessity discreet",
                "Chinese": "不得不保密的谈判",
                "regional_note": ""
            }
        ]
    ],
    "tease": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you tease someone, you make fun of them in an unkind way or say things to annoy or embarrass them.",
                "example_sentences": [
                    "He liked to tease his younger sister about her obsession with pop music."
                ],
                "usage": "tease the colleague about his new haircut",
                "Chinese": "取笑同事的新发型",
                "regional_note": ""
            }
        ]
    ],
    "be explicit about sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you are explicit about something, you speak about it very openly and clearly.",
                "example_sentences": [
                    "The terms of the agreement were made explicit during the meeting to avoid any misunderstandings."
                ],
                "usage": "be explicit about the duties",
                "Chinese": "明确说明职责",
                "regional_note": ""
            }
        ]
    ],
    "be obsequious to sb.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you say A is obsequious to B, you are criticising A because they are too eager to help or agree with B, who is more important than them.",
                "example_sentences": [
                    "His obsequious behaviour towards his boss was noticeable and somewhat off-putting to his colleagues."
                ],
                "usage": "be obsequious to the boss",
                "Chinese": "对老板奉承",
                "regional_note": ""
            }
        ]
    ],
    "navigate the crowd": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you navigate the crowd, you move carefully through a large group of people.",
                "example_sentences": [
                    "I had to navigate the crowd at Piccadilly Circus to catch my bus on time."
                ],
                "usage": "nevigate the crowd at the train station",
                "Chinese": "穿过火车站里的人群",
                "regional_note": ""
            }
        ]
    ],
    "be all ears": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you are all ears, you are very eager to hear what someone has to say.",
                "example_sentences": [
                    "Go on, tell me about your holiday in Cornwall. I'm all ears!"
                ],
                "usage": "be all ears about the new project",
                "Chinese": "非常想听听关于新项目的事",
                "regional_note": ""
            }
        ]
    ],
    "desk worker": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A desk worker is someone who performs their job duties primarily at a desk in an office.",
                "example_sentences": [
                    "As a desk worker, Sarah finds it important to take regular breaks to stretch her legs."
                ],
                "usage": "a bored desk worker",
                "Chinese": "一个无聊的办公室职员",
                "regional_note": ""
            }
        ]
    ],
    "come under fire": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If someone comes under fire, they are criticised or attacked verbally.",
                "example_sentences": [
                    "The Prime Minister came under fire for his handling of the NHS crisis."
                ],
                "usage": "come under fire for the decision",
                "Chinese": "因决定受到批评",
                "regional_note": ""
            }
        ]
    ],
    "mix and match": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If someone mixes and matches, they combine different items or styles in a creative or unconventional way.",
                "example_sentences": [
                    "For a smart casual look, you can mix and match your blazer with different trousers."
                ],
                "usage": "mix and match the accessories",
                "Chinese": "搭配不同的配饰",
                "regional_note": ""
            }
        ]
    ],
    "walk back": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If someone walks back a statement, they retract or modify it to lessen its impact or meaning.",
                "example_sentences": [
                    "The Minister had to walk back his comments after they caused a public outcry."
                ],
                "usage": "walk back the statement",
                "Chinese": "收回发出的声明",
                "regional_note": ""
            }
        ]
    ],
    "dial back": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If someone dials back a situation, they attempt to reduce its intensity or seriousness.",
                "example_sentences": [
                    "Let's dial back the tension and discuss this over a nice cup of tea, shall we?"
                ],
                "usage": "dial back the tension",
                "Chinese": "减轻紧张气氛",
                "regional_note": ""
            }
        ]
    ],
    "crowd surge": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A crowd surge is a sudden, forceful movement of a large group of people in a particular direction.",
                "example_sentences": [
                    "There was a dangerous crowd surge at the football match when the winning goal was scored."
                ],
                "usage": "a crowd surge at the concert",
                "Chinese": "演唱会时暴增的人流量",
                "regional_note": ""
            }
        ]
    ],
    "wrap one's mind around": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you wrap your mind around something, you make an effort to understand or accept a complex or difficult concept.",
                "example_sentences": [
                    "I'm struggling to wrap my mind around the new tax regulations."
                ],
                "usage": "wrap his mind around the difficult concept",
                "Chinese": "理解这个复杂的概念",
                "regional_note": ""
            }
        ]
    ],
    "pile up": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If things pile up, they accumulate or increase in quantity, often causing stress or inconvenience.",
                "example_sentences": [
                    "The dirty dishes have piled up in the sink; it's time for a good wash-up."
                ],
                "usage": "dirty dishes that have piled up over the weekend",
                "Chinese": "周末堆积的脏碗",
                "regional_note": ""
            }
        ]
    ],
    "sound the alarm": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you sound the alarm, you warn people about a dangerous or problematic situation.",
                "example_sentences": [
                    "The neighbourhood watch sounded the alarm about the increase in local burglaries."
                ],
                "usage": "sound the alarm about the increasing crime rate",
                "Chinese": "警告犯罪率的上升",
                "regional_note": ""
            }
        ]
    ],
    "aside from": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you say 'aside from', you are introducing a statement that is not directly related to what you have just said.",
                "example_sentences": [
                    "Aside from the occasional drizzle, the weather in Brighton was quite pleasant for our seaside holiday."
                ],
                "usage": "buy some chocolate aside from the groceries",
                "Chinese": "除了买杂货外还买了巧克力",
                "regional_note": ""
            }
        ]
    ],
    "set up the internet service": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If someone sets up the internet service, they arrange for the internet to be connected and made operational in a particular place.",
                "example_sentences": [
                    "We asked the local broadband provider to set up the internet service in our new flat before we moved in."
                ],
                "usage": "set up the internet service in the new flat",
                "Chinese": "在新公寓安装网络服务",
                "regional_note": ""
            }
        ]
    ],
    "telecom company": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A telecom company is an organisation that provides telecommunications services such as telephone and internet connections.",
                "example_sentences": [
                    "British Telecom, commonly known as BT, is one of the largest telecom companies in the UK."
                ],
                "usage": "work for a telecom company",
                "Chinese": "在一家电信公司工作",
                "regional_note": ""
            }
        ]
    ],
    "internet technician": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "An internet technician is a professional who installs, maintains, and repairs internet connections and related equipment.",
                "example_sentences": [
                    "When our Wi-Fi kept dropping out, we called an internet technician from Virgin Media to sort out the problem."
                ],
                "usage": "call an internet technician to fix the Wi-Fi",
                "Chinese": "请网络技术员来修理Wi-Fi",
                "regional_note": ""
            }
        ]
    ],
    "hit the spot": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you say that something hits the spot, you mean that it is exactly what is needed or wanted at a particular time.",
                "example_sentences": [
                    "After a long day of sightseeing in London, a pint of ale at the local pub really hit the spot."
                ],
                "usage": "some ice creame that would hit the spot",
                "Chinese": "一些现在正好想吃的冰淇淋",
                "regional_note": ""
            }
        ]
    ],
    "break a sweat": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you break a sweat, you begin to perspire due to physical exertion or stress.",
                "example_sentences": [
                    "Despite the challenging hike up Snowdon, our experienced guide didn't even break a sweat."
                ],
                "usage": "not even break a sweat during the marathon",
                "Chinese": "马拉松比赛中甚至没有出一滴汗",
                "regional_note": ""
            }
        ]
    ],
    "delivery person": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A delivery person is someone whose job is to transport and deliver goods to people's homes or places of work.",
                "example_sentences": [
                    "The delivery person from Tesco brought our weekly shop right to our doorstep."
                ],
                "usage": "tip the delivery person",
                "Chinese": "给快递员小费",
                "regional_note": ""
            }
        ]
    ],
    "bummer": [
        "",
        [
            {
                "part_of_speech": "phrase",
                "definition": "If you say that something is a bummer, you mean that it is disappointing, frustrating, or unpleasant.",
                "example_sentences": [
                    "It's a real bummer that it's raining on the day of the village fête."
                ],
                "usage": "leave the party that turned out to be a bummer",
                "Chinese": "离开那个很糟糕的派对",
                "regional_note": ""
            }
        ]
    ],
    "sth. doesn't justify the price": [
        "",
        [
            {
                "part_of_speech": "phrase",
                "definition": "If you say that something doesn't justify the price, you mean that its quality or value does not warrant the amount of money being charged for it.",
                "example_sentences": [
                    "The mediocre service at that posh restaurant certainly doesn't justify the price of the meal."
                ],
                "usage": "only to find the new shoes don't justify the price",
                "Chinese": "结果发现新鞋不值得这个价钱",
                "regional_note": ""
            }
        ]
    ],
    "urban area": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "An urban area is a region characterised by high population density and extensive human-built features, typically referring to a city or town.",
                "example_sentences": [
                    "Central Manchester is a bustling urban area with a rich industrial heritage."
                ],
                "usage": "live in an urban area",
                "Chinese": "居住在市区里",
                "regional_note": ""
            }
        ]
    ],
    "mobile plan": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A mobile plan is a contract or agreement with a mobile phone company that outlines the services, costs, and terms for using a mobile phone network.",
                "example_sentences": [
                    "I switched to a new mobile plan with EE that offers unlimited data and free roaming in Europe."
                ],
                "usage": "sign up for a mobile plan",
                "Chinese": "签订一个新的手机套餐",
                "regional_note": ""
            }
        ]
    ],
    "make the runoff": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If a candidate makes the runoff in an election, they are one of the two candidates who receive the most votes in the first round and proceed to a second round of voting.",
                "example_sentences": [
                    "The incumbent mayor made the runoff after the first round of voting, but faced a tough challenge from the opposition candidate."
                ],
                "usage": "the candidate that made the runoff",
                "Chinese": "进入决选的候选人",
                "regional_note": ""
            }
        ]
    ],
    "take a nosedive": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something takes a nosedive, it falls rapidly and dramatically.",
                "example_sentences": [
                    "The company's share price took a nosedive after the scandal broke."
                ],
                "usage": "the company's share price that took a nosedive",
                "Chinese": "公司暴跌的股价",
                "regional_note": ""
            }
        ]
    ],
    "file one's taxes": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "To file one's taxes means to submit the necessary documents to the tax authorities declaring one's income and calculating the amount of tax owed.",
                "example_sentences": [
                    "It's important to file your taxes on time to avoid penalties."
                ],
                "usage": "file his taxes before the deadline",
                "Chinese": "在截止日期前报税",
                "regional_note": ""
            }
        ]
    ],
    "tax agency": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A tax agency is a government department responsible for collecting taxes.",
                "example_sentences": [
                    "The tax agency sent me a letter requesting additional information for my tax return."
                ],
                "usage": "contact the tax agency",
                "Chinese": "联系税务机关",
                "regional_note": ""
            }
        ]
    ],
    "payroll tax statement": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A payroll tax statement is a document provided by an employer that details an employee's earnings and the corresponding tax deductions.",
                "example_sentences": [
                    "I checked my payroll tax statement to verify the amount of income tax withheld."
                ],
                "usage": "receive the payroll tax statement",
                "Chinese": "收到工资税单",
                "regional_note": ""
            }
        ]
    ],
    "with an open mind": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you approach something with an open mind, you are receptive to new ideas and willing to consider different perspectives.",
                "example_sentences": [
                    "It's essential to approach negotiations with an open mind to find a mutually beneficial agreement."
                ],
                "usage": "go to the meeting with an open mind",
                "Chinese": "带着开放的心态去开会",
                "regional_note": ""
            }
        ]
    ],
    "fire truck": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A fire truck is a large vehicle equipped with firefighting apparatus, used by firefighters to respond to emergencies.",
                "example_sentences": [
                    "The children were excited to see the fire truck with its flashing lights."
                ],
                "usage": "call the fire truck",
                "Chinese": "打电话叫消防车",
                "regional_note": ""
            }
        ]
    ],
    "eat sb. alive": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you say someone will eat you alive, you mean they will criticise or reprimand you severely.",
                "example_sentences": [
                    "I was terrified of giving the presentation as my boss is known to eat people alive if they make mistakes."
                ],
                "usage": "be afraid that the journalists will eat him alive",
                "Chinese": "担心记者们会狠狠批评他",
                "regional_note": ""
            }
        ]
    ],
    "as old as time": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "Something that is as old as time has existed for an immensely long period, often implying great antiquity.",
                "example_sentences": [
                    "The concept of good versus evil is a theme as old as time, found in countless stories and myths."
                ],
                "usage": "a theme that's as old as time",
                "Chinese": "一个古老的主题",
                "regional_note": ""
            }
        ]
    ],
    "take a battering": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If something takes a battering, it suffers significant damage or harm.",
                "example_sentences": [
                    "The old cottage had taken a battering over the years, with its weathered exterior and broken windows."
                ],
                "usage": "the farm that took a battering in the storm",
                "Chinese": "在风暴中受到重创的农场",
                "regional_note": ""
            }
        ]
    ],
    "eggnog": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "Eggnog is a sweet, creamy beverage traditionally made with milk, cream, sugar, and whipped eggs, often enjoyed during the festive season.",
                "example_sentences": [
                    "At the Christmas party, Aunt Margaret served her famous homemade eggnog, much to everyone's delight."
                ],
                "usage": "enjoy a glass of eggnog",
                "Chinese": "喝一杯蛋酒",
                "regional_note": ""
            }
        ]
    ],
    "appoint an attorney": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you appoint an attorney, you officially select them to represent you in legal matters.",
                "example_sentences": [
                    "After receiving the court summons, Mr. Thompson promptly appointed an attorney to handle his case."
                ],
                "usage": "appoint an attorney to handle the case",
                "Chinese": "指定一名律师处理案件",
                "regional_note": ""
            }
        ]
    ],
    "take that tone with sb.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you tell someone not to take that tone with you, you are expressing displeasure at their manner of speaking to you.",
                "example_sentences": [
                    "When her son spoke rudely, Mrs. Higgins sternly said, 'Don't you dare take that tone with me, young man.'"
                ],
                "usage": "tell the student not to take that tone with the teacher",
                "Chinese": "告诉学生不要用那种语气和说话",
                "regional_note": ""
            }
        ]
    ],
    "have got oneself a situation": [
        "",
        [
            {
                "part_of_speech": "phrase",
                "definition": "If you say that someone has got themselves a situation, you mean they have found themselves in a difficult or complicated circumstance.",
                "example_sentences": [
                    "After forgetting his passport at home before an international flight, Tom realised he'd got himself a situation."
                ],
                "usage": "realise that he's got himself a situation",
                "Chinese": "意识到他有麻烦了",
                "regional_note": ""
            }
        ]
    ],
    "20/20 vision": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you have 20/20 vision, you possess normal visual acuity and can see clearly without the need for corrective lenses.",
                "example_sentences": [
                    "Despite spending hours on his computer, James maintained his 20/20 vision and didn't require glasses."
                ],
                "usage": "have 20/20 vision",
                "Chinese": "视力正常",
                "regional_note": ""
            }
        ]
    ],
    "a poor vision": [
        "",
        [
            {
                "part_of_speech": "phrase",
                "definition": "If you have poor vision, you struggle to see clearly and may require corrective lenses or other visual aids.",
                "example_sentences": [
                    "Sarah's poor vision meant she had to sit at the front of the lecture hall to see the blackboard."
                ],
                "usage": "struggle with poor vision",
                "Chinese": "因视力不好而困扰",
                "regional_note": ""
            }
        ]
    ],
    "make out": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you can make out something, you are able to see or distinguish it, often with some difficulty.",
                "example_sentences": [
                    "Through the thick fog, we could just make out the outline of the village church spire."
                ],
                "usage": "make out the price on the menu",
                "Chinese": "看清菜单上的价格",
                "regional_note": ""
            }
        ]
    ],
    "blind as a bat": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you say someone is as blind as a bat, you mean they have very poor eyesight.",
                "example_sentences": [
                    "Without his spectacles, old Mr. Jenkins was as blind as a bat and couldn't even read the newspaper headlines."
                ],
                "usage": "be as blind as a bat without glasses",
                "Chinese": "没有眼镜什么都看不清",
                "regional_note": ""
            }
        ]
    ],
    "blurry vision": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "Blurry vision is a condition where one's eyesight is unclear or unfocused.",
                "example_sentences": [
                    "After working late into the night, Emma experienced blurry vision and decided to rest her eyes."
                ],
                "usage": "have blurry vision",
                "Chinese": "视力模糊",
                "regional_note": ""
            }
        ]
    ],
    "fill out the prescription": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If a doctor fills out a prescription, they write down the details of the medication a patient needs to take.",
                "example_sentences": [
                    "The GP carefully filled out the prescription for antibiotics and handed it to the patient."
                ],
                "usage": "wait for the doctor to fill out the prescription",
                "Chinese": "等待医生开处方",
                "regional_note": ""
            }
        ]
    ],
    "what seems to be the problem": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you ask 'What seems to be the problem?', you are inquiring about the nature of an issue or difficulty someone is experiencing.",
                "example_sentences": [
                    "As the customer approached the help desk with a frown, the assistant politely asked, 'What seems to be the problem, sir?'"
                ],
                "usage": "ask the doctor what seems to be the problem",
                "Chinese": "询问医生出了什么毛病",
                "regional_note": ""
            }
        ]
    ],
    "head on over somewhere": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you head on over somewhere, you go to that place, often casually or informally.",
                "example_sentences": [
                    "After finishing our tea, we decided to head on over to the local pub for a pint."
                ],
                "usage": "head on over to the pub",
                "Chinese": "去那个酒吧",
                "regional_note": ""
            }
        ]
    ],
    "Fortune 500 company": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "A Fortune 500 company is one of the 500 largest and most profitable companies in the United States, as ranked annually by Fortune magazine.",
                "example_sentences": [
                    "Despite being based in London, the British firm's success in America led to its inclusion in the Fortune 500 company list."
                ],
                "usage": "work for a Fortune 500 company",
                "Chinese": "在一家500强公司工作",
                "regional_note": ""
            }
        ]
    ],
    "under someone": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you are under someone in a work context, you are in a subordinate position to them in the organisational hierarchy.",
                "example_sentences": [
                    "As the new department head, Sarah had 50 employees working under her."
                ],
                "usage": "have 50 employees working under him",
                "Chinese": "有50名员工在他的领导下工作",
                "regional_note": ""
            }
        ]
    ],
    "go on about sth.": [
        "",
        [
            {
                "part_of_speech": "",
                "definition": "If you go on about something, you talk about it excessively or for a prolonged period, often to the point of annoyance.",
                "example_sentences": [
                    "During afternoon tea, Grandpa wouldn't stop going on about the good old days, much to the amusement of his grandchildren."
                ],
                "usage": "go on about the same story",
                "Chinese": "不停地讲同一个故事",
                "regional_note": ""
            }
        ]
    ]
}